LBL_Form_Layout_Files=\u0424\u0430\u0439\u043b\u044b \u043c\u0430\u043a\u0435\u0442\u043e\u0432 \u0444\u043e\u0440\u043c
#manifest localization
OpenIDE-Module-Name=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c Platypus
OpenIDE-Module-Short-Description=\u041f\u043e\u0434\u0434\u0435\u0440\u0436\u043a\u0430 \u0432\u0438\u0437\u0443\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u043f\u043e\u0441\u0442\u0440\u043e\u0435\u043d\u0438\u044f \u0444\u043e\u0440\u043c \u0441 \u043c\u043e\u0434\u0443\u043b\u044f\u043c\u0438 Javascript.
OpenIDE-Module-Long-Description=\
    \u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c \u043f\u043e\u0437\u0432\u043e\u043b\u044f\u0435\u0442 \u0432\u0430\u043c \u0440\u0438\u0441\u043e\u0432\u0430\u0442\u044c \u0444\u043e\u0440\u043c\u044b.
OpenIDE-Module-Display-Category=Platypus \u0434\u0438\u0437\u0430\u0439\u043d\u0435\u0440
OpenIDE-Module-Package-Dependency-Message=
# message shown when something wrong with guarded blocks
MSG_ERR_GuardesBlocks=\u0412\u043e\u0437\u043c\u043e\u0436\u043d\u043e, \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043f\u043e\u0432\u0440\u0435\u0436\u0434\u0435\u043d\u043e. GUI builder \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u043d\u0430\u0439\u0442\u0438 \u0440\u0430\u0437\u0434\u0435\u043b\u044b \u0441\u043e \u0441\u0433\u0435\u043d\u0435\u0440\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u043c \u043a\u043e\u0434\u043e\u043c. \u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u044b\u0435 \u043a\u043e\u043c\u043c\u0435\u043d\u0442\u0430\u0440\u0438\u0438, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043e\u0431\u043e\u0437\u043d\u0430\u0447\u0430\u044e\u0442 \u043d\u0430\u0447\u0430\u043b\u043e \u0438 \u043a\u043e\u043d\u0435\u0446 \u044d\u0442\u0438\u0445 \u0440\u0430\u0437\u0434\u0435\u043b\u043e\u0432, \u0431\u044b\u043b\u0438 \u0443\u0434\u0430\u043b\u0435\u043d\u044b \u0438\u043b\u0438 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u044b. \u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u0431\u0443\u0434\u0435\u0442 \u043e\u0442\u043a\u0440\u044b\u0442\u043e \u0442\u043e\u043b\u044c\u043a\u043e \u0434\u043b\u044f \u0447\u0442\u0435\u043d\u0438\u044f. \u0414\u043b\u044f \u0434\u043e\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044c\u043d\u043e\u0439 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u0438 \u0441\u043c. http://wiki.netbeans.org/FormGuardedBlockError 
MSG_ERR_GuardesBlocksTitle=\u041e\u0448\u0438\u0431\u043a\u0430 \u043f\u0440\u0438 \u0440\u0430\u0437\u0431\u043e\u0440\u0435 \u0444\u043e\u0440\u043c\u044b \u0438\u0441\u0445\u043e\u0434\u043d\u043e\u0433\u043e \u0444\u0430\u0439\u043b\u0430 Java

# display names of the buttons switching between form designer and java editor
CTL_DesignTabCaption=&\u041c\u0430\u043a\u0435\u0442
CTL_SourceTabCaption=&\u0421\u043a\u0440\u0438\u043f\u0442

# display name of the Form Settings in Options
CTL_FormSettings=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0439

# name provided from the top-level component, which does not have a variable name to return
CTL_FormTopContainerName=\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435

# display name of the Form Loader
PROP_FormLoader_Name=\u041e\u0431\u044a\u0435\u043a\u0442\u044b \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u044f

# display name of Non-Visual Components Node
CTL_NonVisualComponents=\u0414\u0440\u0443\u0433\u0438\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b

# display name of Non-Visual Components Node
CTL_VisualComponents=\u041c\u0430\u043a\u0435\u0442

# formatting of the form multiview title
FMT_FormTitleWithContainerName={0} [{1}]

MSG_NonEditableTemplate=\u0428\u0430\u0431\u043b\u043e\u043d {0} \u043d\u0435 \u0440\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u0443\u0435\u0442\u0441\u044f

# Control Panel -> Form Objects Property Names
PROP_LISTENER_GENERATION_STYLE=\u0421\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u043e\u0432
HINT_LISTENER_GENERATION_STYLE=\u0421\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043a\u043e\u0434\u0430 \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u043e\u0432 \u0441\u043e\u0431\u044b\u0442\u0438\u0439
PROP_LAYOUT_CODE_TARGET=\u0421\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f
HINT_LAYOUT_CODE_TARGET=\u041a\u043e\u0434 \u0441\u0433\u0435\u043d\u0435\u0440\u0438\u0440\u043e\u0432\u0430\u043d \u0434\u043b\u044f \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043d\u043d\u043e\u0433\u043e \u0444\u043e\u0440\u043c\u0430\u0442\u0430 (\u0442\u0440\u0435\u0431\u0443\u0435\u0442\u0441\u044f Java 6 \u0438\u043b\u0438 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u0430\u044f \u0431\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430)
PROP_AUTO_RESOURCE=\u0410\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u0443\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438
HINT_AUTO_RESOURCE_GLOBAL=\u0420\u0435\u0436\u0438\u043c \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u043e\u0439 \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u0438 \u0434\u043b\u044f \u0432\u043d\u043e\u0432\u044c \u0441\u043e\u0437\u0434\u0430\u043d\u043d\u044b\u0445 \u0444\u043e\u0440\u043c
HINT_AUTO_RESOURCE_LOCAL=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 "\u041b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f" \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0439 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 String \u0432 \u043f\u0430\u043a\u0435\u0442\u0435 \u0440\u0435\u0441\u0443\u0440\u0441\u043e\u0432.\
\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 "\u0412\u0441\u0435 \u0440\u0435\u0441\u0443\u0440\u0441\u044b" \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0441\u0442\u0440\u043e\u043a\u0438, \u0437\u043d\u0430\u0447\u043a\u0430, \u0446\u0432\u0435\u0442\u0430 \u0438 \u0448\u0440\u0438\u0444\u0442\u0430 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0432 \u043f\u0430\u043a\u0435\u0442\u0435 \u0440\u0435\u0441\u0443\u0440\u0441\u043e\u0432.\
\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 "\u0420\u0435\u0441\u0443\u0440\u0441\u044b + \u0418\u043d\u044a\u0435\u043a\u0446\u0438\u044f" \u0434\u043b\u044f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043a\u043e\u0434\u0430 \u0438\u043d\u044a\u0435\u043a\u0446\u0438\u0438 \u0440\u0435\u0441\u0443\u0440\u0441\u043e\u0432 \u0432\u043c\u0435\u0441\u0442\u043e \u0432\u044b\u0437\u043e\u0432\u043e \u043c\u0435\u0442\u043e\u0434\u043e\u0432 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u0438 \u0441\u0432\u043e\u0439\u0441\u0442\u0432.\
\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 Off, \u0447\u0442\u043e\u0431\u044b \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0432\u0441\u0435\u0445 \u0441\u0432\u043e\u0439\u0441\u0442\u0432 \u0433\u0435\u043d\u0435\u0440\u0438\u0440\u043e\u0432\u0430\u043b\u0438\u0441\u044c \u043d\u0435\u043f\u043e\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u0435\u043d\u043d\u043e \u0432 \u0444\u0430\u0439\u043b Java
PROP_AUTO_I18N=\u0410\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0430\u044f \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f
HINT_AUTO_I18N=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0432\u0441\u0435 \u0441\u0442\u0440\u043e\u0447\u043d\u044b\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0432 \u0444\u043e\u0440\u043c\u0435 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438 \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0443\u044e\u0442\u0441\u044f. \
\u0415\u0441\u043b\u0438 \u0432\u044b\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0432\u0441\u0435 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438 \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u043e\u0432\u0430\u043d\u043d\u044b\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0441\u0442\u0430\u043d\u043e\u0432\u044f\u0442\u0441\u044f \u0436\u0435\u0441\u0442\u043a\u043e \u0437\u0430\u043a\u043e\u0434\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u043c\u0438
PROP_AUTO_SET_COMPONENT_NAME=\u0423\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0442\u044c \u0438\u043c\u0435\u043d\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432
HINT_AUTO_SET_COMPONENT_NAME=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e "\u0418\u043c\u044f" \u0432\u0441\u0435\u0445 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438 \u0443\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0435\u0442\u0441\u044f \u0438\u0437 \u0438\u043c\u0435\u043d\u0438 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439
HINT_SELECTION_BORDER_COLOR=\u0426\u0432\u0435\u0442 \u0431\u043e\u0440\u0434\u044e\u0440\u0430 \u0443 \u0432\u044b\u0431\u0440\u0430\u043d\u043d\u043e\u0433\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
HINT_GUIDING_LINE_COLOR=\u0426\u0432\u0435\u0442 \u0432\u0441\u043f\u043e\u043c\u043e\u0433\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0439 \u043b\u0438\u043d\u0438\u0438.
HINT_GRID_SIZE_X=\u0428\u0430\u0433 \u0441\u0435\u0442\u043a\u0438 \u043f\u043e \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u0438 \u043a \u043a\u043e\u0442\u043e\u0440\u043e\u0439 \u0431\u0443\u0434\u0443\u0442 \u043f\u0440\u0438\u0432\u044f\u0437\u044b\u0432\u0430\u0442\u044c\u0441\u044f \u043a\u043e\u043e\u0440\u0434\u0438\u043d\u0430\u0442\u044b \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432
HINT_GRID_SIZE_Y=\u0428\u0430\u0433 \u0441\u0435\u0442\u043a\u0438 \u043f\u043e \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u0438 \u043a \u043a\u043e\u0442\u043e\u0440\u043e\u0439 \u0431\u0443\u0434\u0443\u0442 \u043f\u0440\u0438\u0432\u044f\u0437\u044b\u0432\u0430\u0442\u044c\u0441\u044f \u043a\u043e\u043e\u0440\u0434\u0438\u043d\u0430\u0442\u044b \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432
PROP_VARIABLES_MODIFIER=\u041c\u043e\u0434\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439
HINT_VARIABLES_MODIFIER=\u041c\u043e\u0434\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440 \u0434\u043e\u0441\u0442\u0443\u043f\u0430 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0445, \u0441\u043e\u0437\u0434\u0430\u043d\u043d\u044b\u0445 \u0434\u043b\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432 \u0444\u043e\u0440\u043c\u044b.
HINT_FOLD_GENERATED_CODE=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0441\u043e\u0437\u0434\u0430\u043d\u044b\u0439 \u043a\u043e\u0434 \u043c\u043e\u0436\u0435\u0442 \u0441\u0432\u043e\u0440\u0430\u0447\u0438\u0432\u0430\u0442\u044c\u0441\u044f.
PROP_LAYOUT_COMPONENT_HORIZONTAL_SIZE=\u0413\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u044c\u043d\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440
HINT_LAYOUT_COMPONENT_HORIZONTAL_SIZE=\u041f\u0440\u0435\u0434\u043f\u043e\u0447\u0438\u0442\u0430\u0435\u043c\u044b\u0439 \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u044c\u043d\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u0432 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0438.
PROP_LAYOUT_COMPONENT_VERTICAL_SIZE=\u0412\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u043d\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440
HINT_LAYOUT_COMPONENT_VERTICAL_SIZE=\u041f\u0440\u0435\u0434\u043f\u043e\u0447\u0438\u0442\u0430\u0435\u043c\u044b\u0439 \u0432\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u044c\u043d\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u0432 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0438.
PROP_LAYOUT_COMPONENT_HORIZONTAL_RESIZABLE=\u0418\u0437\u043c\u0435\u043d\u044f\u0435\u043c\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440 \u043f\u043e \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u0438
HINT_LAYOUT_COMPONENT_HORIZONTAL_RESIZABLE=\u041e\u043f\u0440\u0435\u0434\u0435\u043b\u044f\u0435\u0442, \u043c\u043e\u0436\u0435\u0442 \u043b\u0438 \u0438\u0437\u043c\u0435\u043d\u044f\u0442\u0441\u044f \u0440\u0430\u0437\u043c\u0435\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u043f\u043e \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u0438.
PROP_LAYOUT_COMPONENT_VERTICAL_RESIZABLE=\u0418\u0437\u043c\u0435\u043d\u044f\u0435\u043c\u044b\u0439 \u043f\u043e \u0432\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u0438 \u0440\u0430\u0437\u043c\u0435\u0440
HINT_LAYOUT_COMPONENT_VERTICAL_RESIZABLE=\u041e\u043f\u0440\u0435\u0434\u0435\u043b\u044f\u0435\u0442, \u043c\u043e\u0436\u0435\u0442 \u043b\u0438 \u0438\u0437\u043c\u0435\u043d\u044f\u0442\u0441\u044f \u0440\u0430\u0437\u043c\u0435\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u043f\u043e \u0432\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u0438.
HINT_ASSISTANT_SHOWN=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0432 \u0440\u0435\u0434\u0430\u0442\u043e\u0440\u0435 \u043f\u043e\u043a\u0430\u0437\u044b\u0432\u0430\u044e\u0442\u0441\u044f \u043f\u043e\u0434\u0441\u043a\u0430\u0437\u043a\u0438.
PROP_GENERATE_FQN=\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u043a\u0432\u0430\u043b\u0438\u0444\u0438\u0446\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0435 \u0438\u043c\u0435\u043d\u0430 \u043a\u043b\u0430\u0441\u0441\u043e\u0432 \u043f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u043a\u043e\u0434\u0430.
HINT_GENERATE_FQN=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u043f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u043a\u043e\u0434\u0430, \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0442\u0441\u044f \u043a\u0432\u0430\u043b\u0438\u0444\u0438\u0446\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0435 \u0438\u043c\u0435\u043d\u0430 \u043a\u043b\u0430\u0441\u0441\u043e\u0432.

# form toolbar
CTL_SelectionButtonHint=\u0420\u0435\u0436\u0438\u043c \u0432\u044b\u0431\u043e\u0440\u0430
CTL_ConnectionButtonHint=\u0420\u0435\u0436\u0438\u043c "\u0421\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u044f"
CTL_BeansButtonHint=\u0414\u043e\u0431\u0430\u0432\u0438\u0442\u044c...

CTL_PaletteButton_MenuItem=\u041f\u043e\u043a\u0430\u0437\u0430\u0442\u044c \u043a\u043d\u043e\u043f\u043a\u0443 "\u0414\u043e\u0431\u0430\u0432\u0438\u0442\u044c"

ACSD_SelectionMode=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c \u0432 \u0440\u0435\u0436\u0438\u043c\u0435 \u0432\u044b\u0431\u043e\u0440\u0430 \u0438 \u0432\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u044b\u0431\u0438\u0440\u0430\u0442\u044c \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u043d\u0430 \u0444\u043e\u0440\u043c\u0435.
ACSD_ConnectionMode=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c \u0432 \u0440\u0435\u0436\u0438\u043c\u0435 \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u044f \u0438 \u0432\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0441\u043e\u0435\u0434\u0438\u043d\u044f\u0442\u044c \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043c\u0430\u0441\u0442\u0435\u0440\u0430.
ACSD_AddMode=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c \u0432 \u0440\u0435\u0436\u0438\u043c\u0435 \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u0438 \u0432\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0434\u043e\u0431\u0430\u0432\u043b\u044f\u0442\u044c \u0432\u044b\u0431\u0440\u0430\u043d\u043d\u044b\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u043d\u0430 \u0444\u043e\u0440\u043c\u0443.

# HandleLayer
ACSN_HandleLayer=\u0412\u0438\u0437\u0443\u0430\u043b\u044c\u043d\u044b\u0439 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c
ACSD_HandleLayer=\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0439\u0442\u0435 \u043d\u0430\u0432\u0438\u0433\u0430\u0442\u043e\u0440 \u0444\u043e\u0440\u043c\u044b, \u0447\u0442\u043e\u0431\u044b \u043f\u0435\u0440\u0435\u043c\u0435\u0449\u0430\u0442\u044c\u0441\u044f \u043e\u0442 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u043a \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0443 \u0442\u043e\u043b\u044c\u043a\u043e \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u043a\u043b\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u044b

# displayed text of not set value (for "write only" properties)
CTL_ValueNotSet=<\u041d\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e>

# value type displayed as tooltip in property sheet for properties without description
# {0} = property value type name
HINT_PropertyType=({0})

# value type displayed as tooltip in property sheet for properties having some description
# {0} = property value type name
# {1} = the original short description of the property
HINT_PropertyTypeWithDescription=({0})  {1}

# RADComponent PropertySets
CTL_PropertiesTab=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430
CTL_PropertiesTabHint=\u041e\u0431\u0449\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
CTL_Properties2Tab=\u0414\u0440\u0443\u0433\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430
CTL_Properties2TabHint=\u0414\u0440\u0443\u0433\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
CTL_general=\u041e\u0431\u0449\u0438\u0435
CTL_generalHint=\u041e\u0431\u0449\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430
CTL_misc=\u0420\u0430\u0437\u043d\u043e\u0435
CTL_miscHint=\u0420\u0430\u0437\u043d\u044b\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0431\u0435\u0437 \u043a\u043e\u043d\u043a\u0440\u0435\u0442\u043d\u043e\u0439 \u043a\u0430\u0442\u0435\u0433\u043e\u0440\u0438\u0438
# dynamic localizations
CTL_model=\u041c\u043e\u0434\u0435\u043b\u044c
CTL_modelHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u0441\u0432\u044f\u0437\u044b\u0432\u0430\u044e\u0449\u0438\u0435 \u044d\u043b\u0435\u043c\u0435\u043d\u0442 \u0443\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u0441 \u043c\u043e\u0434\u0435\u043b\u044c\u044e
CTL_veer=\u0420\u0430\u0437\u0432\u043e\u0440\u043e\u0442
CTL_veerHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0434\u0438\u043d\u0430\u043c\u0438\u0447\u0435\u0441\u043a\u0438\u0445 \u0441\u0442\u043e\u043b\u0431\u0446\u043e\u0432
CTL_header=\u0421\u0442\u0438\u043b\u044c \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a\u0430
CTL_headerHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0441\u0442\u0438\u043b\u044f \u0437\u0430\u0433\u043e\u043b\u043e\u0432\u043a\u0430
CTL_appearance=\u041e\u0444\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u0435
CTL_appearanceHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u0432\u043b\u0438\u044f\u044e\u0449\u0438\u0435 \u043d\u0430 \u043e\u0444\u043e\u0440\u043c\u043b\u0435\u043d\u0438\u0435
CTL_split=\u0420\u0430\u0437\u0434\u0435\u043b\u0435\u043d\u0438\u0435
CTL_splitHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0440\u0430\u0437\u0434\u0435\u043b\u0435\u043d\u0438\u044f
CTL_tabs=\u0417\u0430\u043a\u043b\u0430\u0434\u043a\u0438
CTL_tabsHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a
CTL_editing=\u0420\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435
CTL_editingHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u0432\u043b\u0438\u044f\u044e\u0449\u0438\u0435 \u043d\u0430 \u0440\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435
CTL_EventsTab=\u0421\u043e\u0431\u044b\u0442\u0438\u044f
CTL_EventsTabHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432
CTL_mouseWheel=\u041a\u043e\u043b\u0451\u0441\u0438\u043a\u043e \u043c\u044b\u0448\u0438
CTL_mouseWheelHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043e\u0442 \u043a\u043e\u043b\u0451\u0441\u0438\u043a\u0430 \u043c\u044b\u0448\u0438
CTL_mouse=\u041c\u044b\u0448\u044c (\u041e\u0431\u0449\u0438\u0435)
CTL_mouseHint=\u041e\u0431\u0449\u0438\u0435 \u0441\u043e\u0431\u044b\u0442\u0438\u044f \u043c\u044b\u0448\u0438
CTL_component=\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442
CTL_componentHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
CTL_mouseMotion=\u0414\u0432\u0438\u0436\u0435\u043d\u0438\u044f \u043c\u044b\u0448\u0438
CTL_mouseMotionHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u0434\u0432\u0438\u0436\u0435\u043d\u0438\u044f \u043c\u044b\u0448\u0438
CTL_container=\u041a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440
CTL_containerHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440\u0430
CTL_change=\u0418\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f
CTL_changeHint=\u041f\u0435\u0440\u0435\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435 \u0437\u0430\u043a\u043b\u0430\u0434\u043e\u043a
CTL_focus=\u0424\u043e\u043a\u0443\u0441
CTL_focusHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u0444\u043e\u043a\u0443\u0441\u0430
CTL_key=\u041a\u043b\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u0430
CTL_keyHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043a\u043b\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u044b
CTL_action=\u0414\u0435\u0439\u0441\u0442\u0432\u0438\u044f
CTL_actionHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0439
CTL_window=\u041e\u043a\u043d\u043e
CTL_windowHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043e\u043a\u043d\u0430
CTL_cells=\u042f\u0447\u0435\u0439\u043a\u0438
CTL_cellsHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438 \u044f\u0447\u0435\u0435\u043a
CTL_value=\u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435
CTL_valueHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f
CTL_map=\u041a\u0430\u0440\u0442\u0430
CTL_mapHint=\u0421\u043e\u0431\u044b\u0442\u0438\u044f \u043a\u0430\u0440\u0442\u044b
CTL_tree=\u0414\u0435\u0440\u0435\u0432\u043e
CTL_treeHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0434\u043b\u044f \u043f\u043e\u0441\u0442\u0440\u043e\u0435\u043d\u0438\u044f \u0434\u0435\u0440\u0435\u0432\u0430
# end of dynamic localizations
CTL_SyntheticTab=\u0421\u043e\u0437\u0434\u0430\u043d\u0438\u0435 \u043a\u043e\u0434\u0430
CTL_SyntheticTabHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0435 \u0441\u043f\u043e\u0441\u043e\u0431\u043e\u043c \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043a\u043e\u0434\u0430
CTL_SyntheticTab_Short=\u041a\u043e\u0434
CTL_LayoutTab=\u0420\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435
CTL_LayoutTabHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f

CTL_SetAction=\u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435...

# property set for root form's node
CTL_ResourceTab=\u0420\u0435\u0441\u0443\u0440\u0441\u044b \u0438 \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f
CTL_ResourceTabHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430, \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0435 \u0430\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u043e\u0439 \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u0435\u0439 \u0438 \u0440\u0435\u0441\u0443\u0440\u0441\u0430\u043c\u0438

# Accessibility support
CTL_AccessibilityTab=\u0414\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0441\u0442\u044c
CTL_AccessibilityTabHint=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043a\u043e\u043d\u0442\u0435\u043a\u0441\u0442\u0430 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0441\u0442\u0438 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
PROP_AccessibleName=\u0414\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0435 \u0438\u043c\u044f
PROP_AccessibleDescription=\u0414\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0435 \u043e\u043f\u0438\u0441\u0430\u043d\u0438\u0435
PROP_AccessibleParent=\u0414\u043e\u0441\u0442\u0443\u043f\u043d\u044b\u0439 \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u044c
MSG_CyclicAccessibleContext=\u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435\u043c \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \"labelFor\" \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0441\u0430\u043c \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442, \u0442.\u043a. \u044d\u0442\u043e \u043f\u0440\u0438\u0432\u0435\u0434\u0435\u0442 \u043a \u0446\u0438\u043a\u043b\u0438\u0447\u0435\u0441\u043a\u043e\u0439 \u0441\u0441\u044b\u043b\u043a\u0435

# names of PasteType for copy/paste and cut/paste operations
CTL_CopyPaste=\u0421\u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u0442\u044c
CTL_CutPaste=\u041f\u0435\u0440\u0435\u043c\u0435\u0441\u0442\u0438\u0442\u044c

# hint for ButtonGroupProperty
HINT_ButtonGroup=\u0413\u0440\u0443\u043f\u043f\u0430 \u043a\u043d\u043e\u043f\u043e\u043a \u0438 \u044d\u043b\u0435\u043c\u0435\u043d\u0442\u043e\u0432 \u043c\u0435\u043d\u044e \u043a \u043a\u043e\u0442\u043e\u0440\u043e\u0439 \u043f\u0440\u0438\u043d\u0430\u0434\u043b\u0435\u0436\u0438\u0442 \u044d\u0442\u043e\u0442 \u0432\u0438\u0434\u0436\u0435\u0442

ERR_COMPONENT_NAME_ALREADY_IN_USE=\u0414\u0432\u0430 \u043a\u043e\u043f\u043d\u0435\u043d\u0442\u0430 \u043e\u0434\u043d\u043e\u0439 \u0438 \u0442\u043e\u0439 \u0436\u0435 \u0444\u043e\u0440\u043c\u044b \u043d\u0435 \u043c\u043e\u0433\u0443\u0442 \u0438\u043c\u0435\u0442\u044c \u043e\u0434\u043d\u043e \u0438 \u0442\u043e \u0436\u0435 \u0438\u043c\u044f.
ERR_INVALID_COMPONENT_NAME=\u0418\u043c\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u0434\u043e\u043b\u0436\u043d\u043e \u0431\u044b\u0442\u044c \u043f\u0440\u0438\u0433\u043e\u0434\u043d\u044b\u043c \u0434\u043b\u044f Java-\u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439.

# user entered value that passed through Property Editor, but failed in setter method of the property
MSG_ERR_WRITING_TO_PROPERTY=\u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439 \"{0}\".

# formatting of a status line text shown during the opening of the form
# {0} = name of the form data object
FMT_PreparingForm=\u041f\u043e\u0434\u0433\u043e\u0442\u043e\u0432\u043a\u0430 \u043a \u043e\u0442\u043a\u0440\u044b\u0442\u0438\u044e \u0444\u043e\u0440\u043c\u044b: {0}
FMT_OpeningForm=\u0417\u0430\u0433\u0440\u0443\u0437\u043a\u0430 \u0444\u043e\u0440\u043c\u044b: {0}
LBL_FormLoading=\u0417\u0430\u0433\u0440\u0443\u0437\u043a\u0430 ...

# error notifications shown when some errors/warnings occur during form loading
FMT_ERR_PersistenceManagerInstantiation=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440 \u043a\u043b\u0430\u0441\u0441\u0430 \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u0447\u0442\u0435\u043d\u0438\u0435\u043c/\u0437\u0430\u043f\u0438\u0441\u044c\u044e \u0444\u043e\u0440\u043c\u044b:\n {0}

# title of the loading errors dialog
CTL_FormLoadingErrors=\u0412 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u0444\u043e\u0440\u043c\u044b \u043f\u0440\u043e\u0438\u0437\u043e\u0448\u043b\u0430 \u043e\u0448\u0438\u0431\u043a\u0430

# warning message when a form was loaded with errors (not all data loaded)
MSG_FormLoadedWithErrors=\u0412 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u0434\u0430\u043d\u043d\u044b\u0445 \u0444\u043e\u0440\u043c\u044b \u043f\u0440\u043e\u0438\u0437\u043e\u0448\u043b\u0438 \u043e\u0448\u0438\u0431\u043a\u0438. \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u044d\u0442\u0443 \u0444\u043e\u0440\u043c\u0443 \u0434\u043b\u044f \u0440\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u044f \u0442\u0435\u043f\u0435\u0440\u044c \u043d\u0435 \u0440\u0435\u043a\u043e\u043c\u0435\u043d\u0434\u0443\u0435\u0442\u0441\u044f.\n\
\u0414\u0430\u043d\u043d\u044b\u0435, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u044c \u043f\u0440\u0438 \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0435\u043c \u0441\u043e\u0445\u0440\u0430\u043d\u0435\u043d\u0438\u0438 \u0431\u0443\u0434\u0443\u0442 \u043f\u043e\u0442\u0435\u0440\u044f\u043d\u044b. \n\
\u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u043f\u043e\u0441\u043c\u043e\u0442\u0440\u0438\u0442\u0435 \u043d\u0430 \u043e\u0448\u0438\u0431\u043a\u0438, \u043f\u043e\u043f\u044b\u0442\u0430\u0439\u0442\u0435\u0441\u044c \u0438\u0441\u043f\u0440\u0430\u0432\u0438\u0442\u044c \u0438\u0445 \u0438 \u043e\u0442\u043a\u0440\u043e\u0439\u0442\u0435 \u0444\u043e\u0440\u043c\u0443 \u0437\u0430\u043d\u043e\u0432\u043e.
CTL_ViewOnly=\u0422\u043e\u043b\u044c\u043a\u043e \u043f\u0440\u043e\u0441\u043c\u043e\u0442\u0440
CTL_AllowEditing=\u0420\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u044c \u0440\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435
CTL_LB_InvalidComponent=\u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439

# title of the warning message above
CTL_FormLoadedWithErrors=\u041f\u0440\u0435\u0434\u0443\u043f\u0440\u0435\u0436\u0434\u0435\u043d\u0438\u0435 - \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e \u0441 \u043e\u0448\u0438\u0431\u043a\u0430\u043c\u0438

# message when there's no PersistenceManager registered for loading forms
MSG_ERR_NoPersistenceManager=\u0412\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u044f\u044f \u043e\u0448\u0438\u0431\u043a\u0430: \u041d\u0435 \u0437\u0430\u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0438\u0440\u043e\u0432\u0430\u043d\u043e \u043d\u0438 \u043e\u0434\u043d\u043e\u0433\u043e \u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440\u0430 \u043a\u043b\u0430\u0441\u0441\u0430, \u0443\u043f\u0440\u0430\u0432\u043b\u044f\u044e\u0449\u0435\u0433\u043e \u0447\u0442\u0435\u043d\u0438\u0435\u043c/\u0441\u043e\u0445\u0440\u0430\u043d\u0435\u043d\u0438\u0435\u043c.\n\
\u042d\u0442\u0430 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u043e.

# message when no registered PersistenceManager is capable of loading the form
MSG_ERR_NotRecognizedForm=\u0424\u043e\u0440\u043c\u0430\u0442 \u0444\u0430\u0439\u043b\u0430 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u043d\u0435 \u0440\u0430\u0441\u043f\u043e\u0437\u043d\u0430\u043d.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u043e.

# message when some errors occurred in accessing the form file
MSG_ERR_LoadingErrors=\u041d\u0435\u043a\u043e\u0442\u043e\u0440\u044b\u043d \u043e\u0448\u0438\u0431\u043a\u0438 \u043f\u0440\u043e\u0438\u0437\u043e\u0448\u043b\u0438 \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u0444\u0430\u0439\u043b\u0430 \u0444\u043e\u0440\u043c\u044b.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u043e.

# message when the form file contains invalid XML
MSG_ERR_InvalidXML=\u0412 \u0444\u0430\u0439\u043b\u0435 \u0444\u043e\u0440\u043c\u044b \u0441\u043e\u0434\u0435\u0440\u0436\u0438\u0442\u0441\u044f \u043d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439 XML.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u043e.

# message when the form file does not contain expected main element
# do not translate "Form"
MSG_ERR_MissingMainElement=\u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442: \u0413\u043b\u0430\u0432\u043d\u044b\u0439 \"Form\" \u044d\u043b\u0435\u043c\u0435\u043d\u0442 \u043d\u0435 \u043d\u0430\u0439\u0434\u0435\u043d.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u043e.

# formatting of message when the for is of unsupported version
# {0} = version number
FMT_ERR_UnsupportedVersion=\u041d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u043c\u0430\u044f \u0432\u0435\u0440\u0441\u0438\u044f \u0444\u0430\u0439\u043b\u0430 \u0444\u043e\u0440\u043c\u044b: {0}.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u043e.

# formatting of warning message printed to console when a substitute form type is used
# {0} name of the opening form
# {1} name of the class used as the fallback form type alternative
# {2} name of the class that could not be used
FMT_FormTypeWarning=[\u041f\u0420\u0415\u0414\u0423\u041f\u0420\u0415\u0416\u0414\u0415\u041d\u0418\u0415] \u041f\u0440\u0438 \u043e\u0442\u043a\u0440\u044b\u0442\u0438\u0438 \u0444\u043e\u0440\u043c\u044b {0} \u043a\u0430\u043a {1}.\n\
\u041d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d \u0431\u0430\u0437\u043e\u0432\u044b\u0439 \u043a\u043b\u0430\u0441\u0441: {2}

# formatting of warning message printed to console when form type in form file
# is not compatible with superclass declared in the java file
# {0} name of the opening form
FMT_IncompatibleFormTypeWarning=[\u041f\u0420\u0415\u0414\u0423\u041f\u0420\u0415\u0416\u0414\u0415\u041d\u0418\u0415] \u0423 \u0444\u043e\u0440\u043c\u044b {0} \u043d\u0435 \u0441\u043e\u0432\u043c\u0435\u0441\u0442\u0438\u043c\u044b\u0439 \u0431\u0430\u0437\u043e\u0432\u044b\u0439 \u043a\u043b\u0430\u0441\u0441.

# formatting of message when the form cannot be based on given class
# {0} = the invalid base class name
FMT_ERR_InvalidBaseClass=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0438\u0442\u044c \u0442\u0438\u043f \u0444\u043e\u0440\u043c\u044b ({0}).\n\
\u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430 \u0443\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c \u0432 \u0442\u043e\u043c, \u0447\u0442\u043e \u043a\u043b\u0430\u0441\u0441 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u0441\u043e\u043e\u0442\u0432\u0435\u0442\u0441\u0432\u0442\u0443\u0435\u0442.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u0440\u044b\u0442\u043e.

# message when the base class of the form cannot be determined
MSG_ERR_CannotDetermineBaseClass=Cannot determine the form type (the base class \
of the form cannot be loaded).\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# message when there's a class name of component missing
MSG_ERR_MissingClass=\u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442: \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0438\u043c\u044f \u043a\u043b\u0430\u0441\u0441\u0430.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# formatting of message when a component class cannot be loaded
# {0} = name of the class that cannot be loaded
FMT_ERR_CannotLoadClass=\u041a\u043b\u0430\u0441\u0441 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u043d\u0435 \u043c\u043e\u0434\u0435\u0442 \u0431\u044b\u0442\u044c \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d {0}.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# formatting of message when an unknow element is found in form file
# {0} = name of the unknown element
FMT_ERR_UnknownElement=\u041d\u0430\u0439\u0434\u0435\u043d \u043d\u0435 \u0438\u0437\u0432\u0435\u0441\u0442\u043d\u044b\u0439 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442: {0}

# formatting of message when a component instance cannot be created
# {0} = name of the class which cannot be instantiated
FMT_ERR_CannotCreateInstance=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440: {0}.\n\
\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# message when initialization of visual layout of loaded container failed
MSG_ERR_LayoutInitFailed=\u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0438\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0440\u0430\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435 \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440\u0430.

# message when no layout support found for a container
MSG_ERR_NoLayoutSupportFound=\u041d\u0435 \u043d\u0430\u0439\u0434\u0435\u043d\u0430 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u043a\u0430 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f.\n\
\u0418\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043e \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0438 \u0432 \u044d\u0442\u043e\u043c \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u0430.

# message when there's a property name missing in form file
MSG_ERR_MissingPropertyName=\u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442: \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 {0}.\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# message when a specified property is unknown
MSG_ERR_UnknownProperty=\u0422\u0430\u043a\u043e\u0433\u043e \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043d\u0435\u0442 \u0432 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0435.

# formatting of message when a property type class cannot be loaded
# {0} = name of the class that cannot be loaded
FMT_ERR_CannotLoadClass2=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u044c \u043a\u043b\u0430\u0441\u0441 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 {0}.\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# message when the stored property type is not compatible with the property
MSG_ERR_IncompatiblePropertyType=\u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442: \u0421\u043e\u0445\u0440\u0430\u043d\u0435\u043d\u043d\u043e\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u0441\u043e\u0432\u043c\u0435\u0441\u0442\u0438\u043c\u043e.\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# message when there's a property type missing in form file
MSG_ERR_MissingPropertyType=\u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442: \u041e\u0442\u0441\u0442\u0443\u0441\u0442\u0432\u0443\u0435\u0442 \u0430\u0442\u0440\u0438\u0431\u0443\u0442 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430.\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# formatting of message when a property editor class cannot be loaded
# {0} = name of the class that cannot be loaded
FMT_ERR_CannotLoadClass3=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u044c \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 {0}.\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# formatting of message when a property editor instance cannot be created
# {0} = name of the class which cannot be instantiated
FMT_ERR_CannotCreateInstance2=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u0430 \u0441\u0432\u043e\u0439\u0442\u0441\u0432\u0430 {0}.\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# formatting of message when a string cannot be decoded as a primitive value
# {0} = decoded string
# {1) = target primitive type
FMT_ERR_CannotDecodePrimitive=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u0435\u0440\u0435\u043a\u043e\u0434\u0438\u0440\u043e\u0432\u0430\u0442\u044c \"{0}\" \u043a\u0430\u043a {1}.\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043e.

# message when some error in reading property value occurs
MSG_ERR_CannotReadPropertyValue=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u0440\u043e\u0447\u0438\u0442\u0430\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430.

# message when a property value is missing in the form file
MSG_ERR_MissingPropertyValue=\u041d\u0435\u043f\u0440\u0430\u0432\u0438\u043b\u044c\u043d\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442: \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430.

# message when a loaded value cannot be set to property
MSG_ERR_CannotSetLoadedValue=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442 \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043d\u043d\u043e\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043a\u0430\u043a \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430.

MSG_SaveConfirmation=\u041c\u0430\u043a\u0435\u0442 {0} \u0438\u0437\u043c\u0435\u043d\u0435\u043d. \u0421\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c?

# formatting of message when trying to save to read only form file
# {0} = name of the form file
FMT_ERR_SaveToReadOnly=\u0412\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u044f\u044f \u043e\u0448\u0438\u0431\u043a\u0430: \u043f\u043e\u043f\u044b\u0442\u043a\u0430 \u0441\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c \u0444\u0430\u0439\u043b, \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u044b\u0439 \u0442\u043e\u043b\u044c\u043a\u043e \u0434\u043b\u044f \u0447\u0442\u0435\u043d\u0438\u044f {0}.

# formatting of message when the form file for saving could not be locked
# {0} = name of the form file
FMT_ERR_CannotLockFormFile=\u0412\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u044f\u044f \u043e\u0448\u0438\u0431\u043a\u0430: \u043d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0437\u0430\u0431\u043b\u043e\u043a\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0444\u0430\u0439\u043b {0}.

# formatting of message when could not write the form file
# {0} = name of the form file
FMT_ERR_CannotWrtiteToFile=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0437\u0430\u043f\u0438\u0441\u0430\u0442\u044c \u0444\u0430\u0439\u043b {0}

# formatting of message when a value cannot be got from property to be saved
# {0} = name of the property
FMT_ERR_CannotGetPropertyValue=C\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u043e\u043b\u0443\u0447\u0438\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \"{0}\".\n\
\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0441\u043e\u0445\u0440\u0430\u043d\u0435\u043d\u043e

# formatting of message when a property value cannot be saved
# {0} = name of the property
FMT_ERR_CannotSaveProperty=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \"{0}\".

# formatting of message when a property value cannot be saved
# {0} = class name of property editor
FMT_ERR_CannotSaveProperty2=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0441 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u043e\u043c {0}.

# formatting of message when a property value cannot be saved
# {0} = value type class name
FMT_ERR_CannotSaveProperty3=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043e\u0445\u0440\u0430\u043d\u0438\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0442\u0438\u043f\u0430 \"{0}\".

# formats for description labels of various loading errors
FMT_ERR_LoadingComponent=\u041e\u0448\u0438\u0431\u043a\u0430 \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430: {0}
FMT_ERR_LoadingComponentProperty=\u041e\u0448\u0438\u0431\u043a\u0430 \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430: {0}
FMT_ERR_LoadingLayout=\u041e\u0448\u0438\u0431\u043a\u0430 \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f: {0}
FMT_ERR_LoadingLayoutProperty=\u041e\u0448\u0438\u0431\u043a\u0430 \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f: {0}
FMT_ERR_LoadingLayoutConstraints=\u041e\u0448\u0438\u0431\u043a\u0430 \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u0438\u0439 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f: {0}
FMT_ERR_LoadingLayoutConstraintsProperty=\u041e\u0448\u0438\u0431\u043a\u0430 \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0437\u0430\u0433\u0440\u0443\u0437\u043a\u0438 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u0438\u0439 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f: {0}

# string used for layout when building a location description of location in
# the tree, e.g. [JFrame]->container1->[layout]->property1
CTL_PathLayout=[\u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435]

# string used for layout when building a location description of location in
# the tree, e.g. [JFrame]->component1->[layout constraints]->property1
CTL_PathLayoutConstraints=[\u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u0438\u044f \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f]

# string used as chain link when building a location description in the tree,
# e.g. [JFrame]->container1->component1
CTL_PathLink=->

# formatting of Error message when a layout initialization fails
# {0} = layout class name
FMT_ERR_LayoutInit=\u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u043f\u0440\u043e\u0438\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435 {0}.\n\
\u0420\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e.

# formatting of error message when no LayoutSupport is found for layout
# {0} = layout class name
FMT_ERR_LayoutNotFound=\u041d\u0435 \u043d\u0430\u0439\u0434\u0435\u043d \u043a\u043b\u0430\u0441\u0441 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044e\u0449\u0438\u0439 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435 {0}.\n\
\u0420\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e.

# message when initialization of visual layout of loaded container failed
MSG_ERR_LayoutInitFailed2=\u0418\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f \u043a\u043b\u0430\u0441\u0441\u0430 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u043a\u0438 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f \u043f\u0440\u043e\u0432\u0430\u043b\u0438\u043b\u0430\u0441\u044c.\n\
\u0411\u0443\u0434\u0435\u0442 \u0438\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0430 \u0442\u043e\u043b\u044c\u043a\u043e \u0431\u0430\u0437\u043e\u0432\u0430\u044f \u043e\u0433\u0440\u0430\u043d\u0438\u0447\u0435\u043d\u043d\u0430\u044f \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u043a\u0430.

# message shows restriction of usage of Borders
MSG_BorderNotApplicable=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u0440\u0438\u043c\u0435\u043d\u0438\u0442\u044c \u0431\u043e\u0440\u0434\u044e\u0440. \u0411\u043e\u0440\u0434\u044e\u0440\u044b \u043c\u043e\u0433\u0443\u0442 \u0438\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u0442\u043e\u043b\u044c\u043a\u043e \u0441 \u043d\u0430\u0441\u043b\u0435\u0434\u043d\u0438\u043a\u0430\u043c\u0438 JComponent.

# message shows restriction of usage of In-place text editing
MSG_ComponentNotShown=\u0420\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u0442\u0435\u043a\u0441\u0442\u0430 \u043f\u0440\u044f\u043c\u043e \u043d\u0430 \u0444\u043e\u0440\u043c\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044f \u0442\u043e\u043b\u044c\u043a\u043e \u0434\u043b\u044f \u0432\u0438\u0437\u0443\u0430\u043b\u044c\u043d\u044b\u0445 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432.

# formatting of error message when class of component added to form from palette
# cannot be loaded
# {0} = name of the class that cannot be loaded
# {1} = expected source of the component
FMT_ERR_CannotLoadClass4=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0437\u0430\u0433\u0440\u0443\u0437\u0438\u0442\u044c \u043a\u043b\u0430\u0441\u0441 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 {0} \u0438\u0437 {1}.\n\u041a\u043b\u0430\u0441\u0441 \
\u0414\u043e\u043b\u0436\u0435\u043d \u0431\u044b\u0442\u044c \u043e\u0442\u043a\u043e\u043c\u043f\u0438\u043b\u0438\u0440\u043e\u0432\u0430\u043d \u0438 \u0434\u043e\u0441\u0442\u0443\u043f\u0435\u043d \u043f\u043e \u043f\u0443\u0442\u044f\u043c \u043a\u043b\u0430\u0441\u0441\u043e\u0432.

# component instantiation error message
MSG_ERR_CannotInstantiate=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043e\u0437\u0434\u0430\u0442\u044c \u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430. \u041f\u043e\u0436\u0430\u043b\u0443\u0439\u0441\u0442\u0430, \u0443\u0431\u0435\u0434\u0438\u0442\u0435\u0441\u044c \u0432 \u0442\u043e\u043c, \u0447\u0442\u043e \u044d\u0442\u043e JavaBeans-\u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442.

# component instantiation error during copying
MSG_ERR_CannotCopyInstance=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u0441\u043a\u043e\u043f\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.

# message when trying to add (or copy) form class object to the same form
MSG_ERR_CannotAddForm=\u0424\u043e\u0440\u043c\u0443 \u043d\u0435\u043b\u044c\u0437\u044f \u0434\u043e\u0431\u0430\u0432\u0438\u0442\u044c \u0441\u0430\u043c\u0443 \u0432 \u0441\u0435\u0431\u044f.

# Component Inspector Title
CTL_InspectorTitle=\u0418\u043d\u0441\u043f\u0435\u043a\u0442\u043e\u0440
ACS_ComponentTree=\u0414\u0435\u0440\u0435\u0432\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432
ACSD_ComponentTree=N/A
HINT_ComponentInspector=\u0418\u043d\u0441\u043f\u0435\u043a\u0442\u043e\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432

# formatting of component node display name
# {0} = name of the component (typically variable name)
# {1} = short name of component class (without package)
FMT_ComponentNodeName={0} [{1}]

# formatting of component node display name for a component without a name
# {0} = short name of component class (without package)
FMT_UnnamedComponentNodeName=[{0}]

# formatting of form root node display name
# {0} = name of the form (class name)
FMT_FormNodeName=\u041f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 "{0}"

# formatting of a message that is displayed in the status line during setting layout
# {0} = class name of the layout
# {1} = displayName of the container to set the layout on
#FMT_MSG_SetLayout=Set {0} on {1}.

# formatting of a message that is displayed in the status line during setting layout
# when the layout cannot be set
# {0} = displayName of the container it is not possible to set the layout on
#FMT_MSG_CannotSetLayout=Cannot set layout on {0}.

# formatting of a message that is displayed in the status line during setting border
# {0} = class name of the border
# {1} = displayName of the component to set the border on
#FMT_MSG_SetBorder=Set {0} on {1}.

# formatting of a message that is displayed in the status line during setting border
# {0} = displayName of the component, the border cannot be set on
#FMT_MSG_CannotSetBorder=Cannot set border on {0}.

# formatting of a message that is displayed in the status line during adding
# a new component to a container
# {1} = short class name (without package) of the component to add
# {2} = display name of the container to add the component to
#FMT_MSG_AddComponent=Add {0} to {1}.

# formatting of a message that is displayed in the status line during adding
# a new component to "Other Components"
# {0} = short class name (without package) of the component to add
#FMT_MSG_AddToOthers=Add {0} to Other Components.

FMT_MSG_AddingComponent=\u0414\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u0435 {0}

# form designer resizing
# {0} = current designer width
# {1} = current designer height
FMT_HINT_DesignerResizing=[{0}, {1}] \u0427\u0442\u043e\u0431\u044b \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u0440\u0430\u0437\u043c\u0435\u0440 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u0430, \u043f\u0435\u0440\u0435\u0442\u0430\u0449\u0438\u0442\u0435 \u0433\u0440\u0430\u043d\u0438\u0446\u0443.
FMT_HINT_DesignerSize=[{0}, {1}]
CTL_SetDesignerSize_Title=\u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0440\u0430\u0437\u043c\u0435\u0440 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u0430
CTL_SetDesignerSize_Label=&\u041d\u043e\u0432\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440 (\u0448\u0438\u0440\u0438\u043d\u0430, \u0432\u044b\u0441\u043e\u0442\u0430):

# Events
MSG_CannotAttach=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u0440\u0438\u0441\u043e\u0435\u0434\u0438\u043d\u0438\u0442\u0441\u044f \u043a \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a\u0443 \u0441\u043e\u0431\u044b\u0442\u0438\u044f.\n\
\t\u041e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a \u0441\u043e\u0431\u044b\u0442\u0438\u044f \u0443\u0436\u0435 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0434\u043b\u044f \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u043a\u0438 \u0441\u043e\u0431\u044b\u0442\u0438\u044f \u0434\u0440\u0443\u0433\u043e\u0433\u043e \u0442\u0438\u043f\u0430.
MSG_CannotRename=\u041d\u0435 \u0443\u0434\u0430\u0435\u0442\u0441\u044f \u043f\u0435\u0440\u0435\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0439 \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a \u0441\u043e\u0431\u044b\u0442\u0438\u044f.\n\
\t\u0427\u0442\u043e\u0431\u044b \u043f\u0435\u0440\u0435\u043f\u0440\u0438\u0441\u043e\u0435\u0434\u0438\u043d\u0438\u0442\u044c \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a, \u0441\u043d\u0430\u0447\u0430\u043b\u0430 \u043e\u0442\u0441\u043e\u0435\u0434\u0438\u043d\u0438\u0442\u0435 \u0435\u0433\u043e \u043e\u0442 \u0442\u0435\u043a\u0443\u0449\u0435\u0433\u043e \u043e\u0431\u0440\u0430\u0431\u0442\u0447\u0438\u043a\u0430 \u0438 \u043f\u0440\u0438\u0441\u043e\u0435\u0434\u0438\u043d\u0438\u0442\u0435 \u0435\u0433\u043e \u043a \u043d\u043e\u0432\u043e\u043c\u0443.

# The string event property value name when no event handler is attached to the event
CTL_NoEvent=<\u041d\u0435\u0442>
FMT_MSG_InvalidJavaIdentifier={0} \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0438\u0434\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440\u043e\u043c JavaScript.
FMT_MSG_EmptyString=\u041f\u0443\u0441\u0442\u0430\u044f \u0441\u0442\u0440\u043e\u043a\u0430

# Code Generation
# A code generated into a new event handler method
# PARTIAL do not translate TODO
MSG_EventHandlerBody=// TODO \u0414\u043e\u0431\u0430\u0432\u044c\u0442\u0435 \u0441\u0432\u043e\u0439 \u043a\u043e\u0434:\n

CTL_LISTENER_ANONYMOUS_CLASSES=\u0410\u043d\u043e\u043d\u0438\u043c\u043d\u044b\u0439 \u0432\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u0438\u0439 \u043a\u043b\u0430\u0441\u0441
CTL_LISTENER_CEDL_INNERCLASS=\u041e\u0434\u0438\u043d \u0432\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u044b\u0439 \u043a\u043b\u0430\u0441\u0441
CTL_LISTENER_CEDL_MAINCLASS=\u0413\u043b\u0430\u0432\u043d\u044b\u0439 \u043a\u043b\u0430\u0441\u0441

CTL_LAYOUT_CODE_AUTO=\u0410\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438
CTL_LAYOUT_CODE_JDK6=\u0421\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u044b\u0439 \u043a\u043e\u0434 Java 6
CTL_LAYOUT_CODE_LIBRARY=\u0411\u0438\u0431\u043b\u0438\u043e\u0442\u0435\u043a\u0430, \u0440\u0430\u0441\u0448\u0438\u0440\u044f\u044e\u0449\u0430\u044f \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f (Swing Layout Extensions Library)

CTL_AUTO_RESOURCE_DEFAULT=\u041f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e
CTL_AUTO_RESOURCE_ON=\u0412\u043a\u043b\u044e\u0447\u0435\u043d\u043e
CTL_AUTO_RESOURCE_OFF=\u0412\u044b\u043a\u043b\u044e\u0447\u0435\u043d\u043e

CTL_AUTO_NAMING_DEFAULT=\u041f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e
CTL_AUTO_NAMING_ON=\u0412\u043a\u043b\u044e\u0447\u0435\u043d\u043e
CTL_AUTO_NAMING_OFF=\u0412\u044b\u043a\u043b\u044e\u0447\u0435\u043d\u043e

CTL_AUTO_OFF=\u0412\u044b\u043a\u043b\u044e\u0447\u0435\u043d\u043e
CTL_AUTO_I18N=\u041b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f
CTL_AUTO_RESOURCING=\u0412\u0441\u0435 \u0440\u0435\u0441\u0443\u0440\u0441\u044b
CTL_AUTO_INJECTION=\u0412\u0441\u0435 \u0440\u0435\u0441\u0443\u0440\u0441\u044b + \u0418\u043d\u044a\u0435\u043a\u0446\u0438\u044f

PROP_FORM_BUNDLE=\u0424\u0430\u0439\u043b \u0441\u0442\u0440\u043e\u043a\u043e\u0432\u044b\u0445 \u0440\u0435\u0441\u0443\u0440\u0441\u043e\u0432
HINT_FORM_BUNDLE=\u0418\u043c\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0430 \u0444\u0430\u043b\u0430 \u0441\u0442\u0440\u043e\u043a\u043e\u0432\u044b\u0445 \u0440\u0435\u0441\u0443\u0440\u0441\u043e\u0432 (\u0444\u0430\u0439\u043b \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u0430\u043d\u0438\u044e \u0443\u043a\u0430\u0437\u044b\u0432\u0430\u0435\u0442\u0441\u044f \u0431\u0435\u0437 \u0440\u0430\u0441\u0448\u0438\u0440\u0435\u043d\u0438\u044f)

PROP_DESIGN_LOCALE=\u0420\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043c\u0435\u0441\u0442\u043e\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435 \u0438 \u044f\u0437\u044b\u043a
HINT_DESIGN_LOCALE=\u0421\u043f\u0435\u0446\u0438\u0444\u0438\u0447\u043d\u0430\u044f \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f \u0438\u0441\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u043d\u0430\u044f \u0438\u043b\u0438 \u0438\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u043d\u0430\u044f \u0432 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u0435

# Comments generated around generated variables declarations
MSG_VariablesBegin=// \u041e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u044f \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0445 - \u043d\u0435 \u043f\u0440\u0430\u0432\u044c\u0442\u0435
MSG_VariablesEnd=// \u041a\u043e\u043d\u0435\u0446 \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u044f \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0445
MSG_EventDispatchCodeComment=// \u041a\u043e\u0434 \u0434\u043e\u0441\u0442\u0430\u0432\u043a\u0438 \u0441\u043e\u0431\u044b\u0442\u0438\u0439 \u043a \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u0430\u043c.\n
MSG_GeneratedCode=\u0421\u043e\u0437\u0434\u0430\u043d\u043d\u044b\u0439 \u043a\u043e\u0434
MSG_WrongLocalVariableSettingComment=\n// \u041f\u0420\u0415\u0414\u0423\u041f\u0420\u0415\u0416\u0414\u0415\u041d\u0418\u0415: \u041f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u0430\u044f {0} \u043d\u0430 \u0434\u043e\u043b\u0436\u043d\u0430 \u0431\u044b\u0442\u044c \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0430 \u043a\u0430\u043a \u043b\u043e\u043a\u0430\u043b\u043d\u0430\u044f \u0432 \u043c\u0435\u0442\u043e\u0434\u0435  \"initComponents()\" \u0442.\u043a. \n \
// \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u0444\u043e\u0440\u043c\u044b \"\u0421\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u043e\u0432\" \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e \u043a\u0430\u043a \"\u0413\u043b\u0430\u0432\u043d\u044b \u0439\u043a\u043b\u0430\u0441\u0441\" \u0438\u043b\u0438 \"\u041e\u0434\u0438\u043d \u0432\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u0438\u0439 \u043a\u043b\u0430\u0441\u0441\".\n \
// \u0412\u043a\u043b\u044e\u0447\u0438\u0442\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u0444\u043e\u0440\u043c\u044b \"\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u043b\u043e\u043a\u0430\u043b\u043d\u044b\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435\" \u0438 \n \
// \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0444\u043e\u0440\u043c\u044b \"\u041b\u043e\u043a\u0430\u043b\u044c\u043d\u044b\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435\" \u0438 \"\u0421\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u043e\u0432\".\n

VALUE_codeGen_generate=\u0421\u043e\u0437\u0434\u0430\u0442\u044c \u043a\u043e\u0434
VALUE_codeGen_serialize=\u0417\u0430\u043f\u0438\u0441\u0430\u0442\u044c

MSG_JC_BeanClass=\u041a\u043b\u0430\u0441\u0441 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
MSG_JC_BeanClassDesc=\u041a\u043b\u0430\u0441\u0441 \u044d\u0442\u043e\u0433\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_VariableName=\u0418\u043c\u044f
MSG_JC_VariableDesc=\u0418\u043c\u044f \u0433\u043b\u043e\u0431\u0430\u043b\u044c\u043d\u043e\u0439 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439, \u0441\u043e\u0437\u0434\u0430\u043d\u043d\u043e\u0439 \u0434\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_TypeParameters=\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0442\u0438\u043f\u0430
MSG_JC_TypeParametersDesc=\u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0442\u0438\u043f\u0430 \u0441\u0442\u0440\u043e\u043a\u0430.
MSG_JC_VariableModifiers=\u041c\u043e\u0434\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440\u044b \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439
MSG_JC_VariableModifiersDesc=\u041c\u043e\u0434\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440\u044b \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0445, \u0441\u043e\u0437\u0434\u0430\u043d\u043d\u044b\u0445 \u0434\u043b\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_CodeGeneration=\u0421\u043e\u0437\u0434\u0430\u043d\u0438\u0435 \u043a\u043e\u0434\u0430
MSG_JC_CodeGenerationDesc=\u0422\u0438\u043f \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043a\u043e\u0434\u0430 \u043a\u043e\u043c\u043e\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_PreCreationCode=\u041a\u043e\u0434 \u043f\u0435\u0440\u0435\u0434 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435\u043c
MSG_JC_PreCreationCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044b\u0439 \u043f\u0435\u0440\u0435\u0434 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435\u043c \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_PostCreationCode=\u041a\u043e\u0434 \u043f\u043e\u0441\u043b\u0435 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f
MSG_JC_PostCreationCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044b\u0439 \u043f\u043e\u0441\u043b\u0435 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_PreInitCode=\u041a\u043e\u0434 \u043f\u0435\u0440\u0435\u0434 \u0438\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u0435\u0439
MSG_JC_PreInitCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u0435\u0440\u0435\u0434 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u043e\u0439 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u044b\u0445 \u0441\u0432\u043e\u0439\u0441\u0442\u0432 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_PostInitCode=\u041a\u043e\u0434 \u043f\u043e\u0441\u043b\u0435 \u0438\u043d\u0438\u0446\u0438\u043b\u0438\u0437\u0430\u0446\u0438\u0438
MSG_JC_PostInitCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u043e\u0441\u043b\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u0438 \u0441\u0442\u0430\u043d\u0434\u0430\u0440\u0442\u043d\u044b\u0445 \u0441\u0432\u043e\u0439\u0441\u0442\u0432 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430.
MSG_JC_PostListenersCode=\u041a\u043e\u0434 \u043f\u043e\u0441\u043b\u0435 \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u043e\u0432
MSG_JC_PostListenersCodeDesc=\u041a\u043e\u0434 \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043a\u043e\u0434\u0430 \u0434\u043b\u044f \u0432\u0441\u0435\u0445 \u0441\u0432\u043e\u0439\u0441\u0442\u0432 \u0438 \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u043e\u0432.
MSG_JC_PreAddCode=\u041a\u043e\u0434 \u043f\u0435\u0440\u0435\u0434 \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u0435\u043c
MSG_JC_PreAddCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u0435\u0440\u0435\u0434 \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u0435\u043c \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u0432 \u0435\u0433\u043e \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440.
MSG_JC_PostAddCode=\u041a\u043e\u0434 \u043f\u043e\u0441\u043b\u0435 \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u044f
MSG_JC_PostAddCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u043e\u0441\u0434\u0435 \u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 \u0432 \u0435\u0433\u043e \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440.
MSG_JC_PrePopulationCode=\u041a\u043e\u0434 \u043f\u0435\u0440\u0435\u0434 \u043d\u0430\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0435\u043c
MSG_JC_PrePopulationCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u0435\u0440\u0435\u0434 \u0442\u0435\u043c \u043a\u0430\u043a \u0434\u043e\u0447\u0435\u0440\u043d\u0438\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u0434\u043e\u0431\u0430\u0432\u043b\u044f\u044e\u0442\u0441\u044f \u0432 \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440.
MSG_JC_PostPopulationCode=\u041a\u043e\u0434 \u043f\u043e\u0441\u043b\u0435 \u043d\u0430\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u044f
MSG_JC_PostPopulationCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u043e\u0441\u043b\u0435 \u0442\u043e\u0433\u043e \u043a\u0430\u043a \u0434\u043e\u0447\u0435\u0440\u043d\u0438\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u0434\u043e\u0431\u0430\u0432\u043b\u044f\u044e\u0442\u0441\u044f \u0432 \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440.
MSG_JC_AfterAllSetCode=\u041a\u043e\u0434 \u043f\u043e\u0441\u043b\u0435 \u0432\u0441\u0435\u0445 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043e\u043a
MSG_JC_AfterAllSetCodeDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u043e\u0441\u043b\u0435 \u0442\u043e\u0433\u043e \u043a\u0430\u043a \u0432\u0441\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u043f\u043e\u043b\u043d\u043e\u0441\u0442\u044c\u044e \u043f\u0440\u043e\u0438\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u043d\u044b.
MSG_JC_PreDeclaration=\u041a\u043e\u0434 \u043f\u0435\u0440\u0435\u0434 \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u0435\u043c
MSG_JC_PreDeclarationDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044b\u0439 \u043f\u0435\u0440\u0435\u0434 \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u0435\u043c \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439.
MSG_JC_PostDeclaration=\u041a\u043e\u0434 \u043f\u043e\u0441\u043b\u0435 \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u044f
MSG_JC_PostDeclarationDesc=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043d\u044b\u0439 \u043f\u043e\u0441\u043b\u0435 \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u044f \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439.
MSG_JC_SerializeTo=\u0417\u0430\u043f\u0438\u0441\u044b\u0432\u0430\u0442\u044c \u0432
MSG_JC_SerializeToDesc=\u0424\u0430\u0439\u043b, \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0439 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 \u0431\u0443\u0434\u0435\u0442 \u0437\u0430\u043f\u0438\u0441\u044b\u0432\u0430\u0442\u044c\u0441\u044f.
MSG_JC_CustomCreationCode=\u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u044b\u0439 \u043a\u043e\u0434 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f
MSG_JC_CustomCreationCodeDesc=\u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u044b\u0439 \u043a\u043e\u0434 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440\u0430.
MSG_JC_UseLocalVar=\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u0443\u044e \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u0443\u044e
MSG_JC_UseLocalVarDesc=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0431\u0443\u0434\u0435\u0442 \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0430 \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u0430\u044f \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u0430\u044f \u0432 \u043c\u0435\u0442\u043e\u0434\u0435 initComponents().

HINT_VARIABLES_LOCAL=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0434\u043b\u044f \u043a\u043b\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432 \u0431\u0443\u0434\u0443\u0442 \u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u044b \u043b\u043e\u043a\u0430\u043b\u044c\u043d\u044b\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u0432 \u043c\u0435\u0442\u043e\u0434\u0435 initComponents().
PROP_VARIABLES_LOCAL=\u041b\u043e\u043a\u0430\u043b\u044c\u043d\u044b\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435

HINT_GENERATE_MNEMONICS=\u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0438\u0442\u044c \u043c\u043d\u0435\u043c\u043e\u043d\u0438\u043a\u0438 \u043c\u0435\u0442\u043e\u043a \u0438 \u043a\u043d\u043e\u043f\u043e\u043a \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u0441\u0438\u043c\u0432\u043e\u043b\u0430 '&' \
\u0432\u043d\u0443\u0442\u0440\u0438 \u0442\u0435\u043a\u0441\u0442\u0430 \u0432\u043c\u0435\u0441\u0442\u043e \u0442\u043e\u0433\u043e, \u0447\u0442\u043e\u0431\u044b \u0443\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0442\u044c \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0442\u0435\u043a\u0442\u0438 \u043c\u043d\u0435\u043c\u043e\u043d\u0438\u043a\u0430 \u043f\u043e \u043e\u0442\u0434\u0435\u043b\u044c\u043d\u043e\u0441\u0442\u0438. \
\u0422\u0430\u043a\u043e\u0439 \u043f\u043e\u0434\u0445\u043e\u0434 \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u0438\u0432\u0430\u0435\u0442 \u0442\u043e\u0447\u043d\u043e\u0435 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u0438\u0435 \u043c\u043d\u0435\u043c\u043e\u043d\u0438\u043a \u0438 \u043b\u0435\u0433\u043a\u0443\u044e \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044e.\
\u0425\u043e\u0442\u044f \u0442\u0430\u043a\u0430\u044f \u0432\u043e\u0437\u043c\u043e\u0436\u043d\u043e\u0441\u0442\u044c \u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u043d\u0430\u043b\u0438\u0447\u0438\u044f \u043a\u043b\u0430\u0441\u0441\u0430 org.openide.awt.Mnemonics class, \u0438 \u043f\u043e\u044d\u0442\u043e\u043c\u0443 \u0432\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u0432\u043a\u043b\u044e\u0447\u0430\u0442\u044c \u0435\u0451 \u0442\u043e\u043b\u044c\u043a\u043e \u0435\u0441\u043b\u0438 \u0432\u044b \u0440\u0430\u0437\u0440\u0430\u0431\u0430\u0442\u044b\u0432\u0430\u0435\u0442\u0435 \u0432 \u0441\u0440\u0435\u0434\u0435 NetBeans.
HINT_GENERATE_MNEMONICS2=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e "text" \u0434\u043b\u044f \u043a\u043d\u043e\u043f\u043e\u043a \u0438 \u043c\u0435\u0442\u043e\u043a \u0441\u043e\u0437\u0434\u0430\u0435\u0442\u0441\u044f \u0441 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435\u043c \u043a\u043b\u0430\u0441\u0441\u0430 org.openide.awt.Mnemonics
PROP_GENERATE_MNEMONICS=\u0421\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043a\u043e\u0434 \u043c\u043d\u0435\u043c\u043e\u043d\u0438\u043a

# ParametersPicker, PropertyPicker, MethodPicker
# {0} = required type (short class name)
CTL_FMT_CW_SelectMethod=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u043c\u0435\u0442\u043e\u0434 ({0})
# {0} = required type (short class name)
CTL_FMT_CW_SelectProperty=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e ({0})

CTL_CW_Component=&\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442:
ACSD_CTL_CW_Component=N/A
CTL_CW_NotSet=<\u041d\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e>
CTL_CW_Code=<\u041a\u043e\u0434>
CTL_CW_GetParametersFrom=\u0412\u0437\u044f\u0442\u044c \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0438\u0437:
CTL_CW_Value=&\u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435:
ACSD_CTL_CW_Value=N/A
CTL_CW_Bean=\u041a\u043e\u043c\u043f\u043e\u043d\u0435&\u043d\u0442:
ACSD_CTL_CW_Bean=N/A
CTL_CW_Property=&\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e:
ACSD_CTL_CW_Property=N/A
CTL_CW_NoProperty=<\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u043d\u0435 \u0432\u044b\u0431\u0440\u0430\u043d\u043e>
CTL_CW_Method=\u0412\u044b\u0437\u043e\u0432 \u043c\u0435\u0442\u043e\u0434\u0430:
CTL_CW_MethodCall=\u0412\u044b\u0437\u043e\u0432 \u043c\u0435\u0442\u043e\u0434\u0430
ACSD_CTL_CW_Method=N/A
CTL_CW_NoMethod=<\u041c\u0435\u0442\u043e\u0434 \u043d\u0435 \u0432\u044b\u0431\u0440\u0430\u043d>
CTL_CW_UserCode=\u041f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u0441\u043a\u0438\u0439 \u043a\u043e\u0434:
ACSD_CTL_CW_UserCode=N/A
CTL_CW_SelectBean=<\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442>
CTL_CW_MethodList=&\u041c\u0435\u0442\u043e\u0434\u044b
ACSD_CTL_CW_MethodList=N/A
CTL_CW_PropertyList=&\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430
ACSD_CTL_CW_PropertyList=N/A
ACSD_ParametersPicker=N/A
ACSD_PropertyPicker=N/A
ACSD_MethodPicker=N/A

ACSD_CTL_CW_ValueField=N/A
ACSD_CTL_CW_BeanCombo=N/A
ACSD_CTL_CW_PropertyLabel=N/A
ACSD_CTL_CW_MethodLabel=N/A
ACSD_CTL_CW_UserCodeArea=N/A

ACSD_CTL_CW_PropertyButton=N/A
ACSD_CTL_CW_MethodButton=N/A

#ParametersPicker - nothing was entered
ERR_NothingEntered=\u041d\u0435 \u0432\u0432\u0435\u0434\u0435\u043d\u043e \u043d\u0438\u043a\u0430\u043a\u043e\u0433\u043e \u043f\u043e\u0434\u0445\u043e\u0434\u044f\u0449\u0435\u0433\u043e \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f.

# RADConnectionPropertyEditor - display name
CTL_FormConnection_DisplayName=\u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0438\u0437 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u044e\u0449\u0435\u0433\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
CTL_CustomCode_DisplayName=\u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u044b\u0439 \u043a\u043e\u0434
ACSN_CustomCode_EditorPane=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u043a\u043e\u0434\u0430

# text displayed when connection is not valid (e.g. component removed)
CTL_CONNECTION_INVALID=<\u041d\u0435\u043f\u043e\u0434\u0445\u043e\u0434\u044f\u0449\u0435\u0435 \u0441\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u0438\u0435>

# Formatting of display value for connection to property
# {0} = name of the component to obtain the property from
# {1} = name of the property
FMT_PROPERTY_CONN=<{0}.{1}>

# Formatting of display value for connection to bean
# {0} = name of the component to obtain the property from
FMT_BEAN_CONN=<{0}>

# Formatting of display value for connection to property
# {0} = name of the component to call the method on
# {1} = name of the method
FMT_METHOD_CONN=<{0}.{1}>

# Formatting of display value for connection to value
# {0} = the value string
FMT_VALUE_CONN=<\u0417\u043d\u0430\u0447\u043d\u0438\u0435: {0}>

# display value for connection to custom code
CTL_CODE_CONN=<\u041f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u0435\u043b\u044c\u0441\u043a\u0438\u0439 \u043a\u043e\u0434>

# property value of array type is displayed as Array of ...<br> 
CTL_ArrayOf=\u041c\u0430\u0441\u0441\u0438\u0432

# default names of adding MenuItems during menu editing.
CTL_DefaultFileMenu=\u0424\u0430\u0439\u043b
CTL_DefaultEditMenu=\u0420\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435

#ComponentChooserEditor
CTL_NoComponent=<\u041d\u0435\u0442 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430>
CTL_DefaultComponent=<\u041f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e>
CTL_InvalidReference=<\u041d\u0435\u043f\u043e\u0434\u0445\u043e\u0434\u044f\u0449\u0430\u044f \u0441\u0441\u044b\u043b\u043a\u0430>
CTL_ComponentChooserEditor_DisplayName=\u0412\u044b\u0431\u043e\u0440 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430

#OrienationProperty
CTL_Horizontal=\u0413\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u044c\u043d\u0430\u044f
CTL_Vertical=\u0412\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u044c\u043d\u0430\u044f

#HorizontalPositionProperty
CTL_Left=\u0421\u043b\u0435\u0432\u0430
CTL_Center=\u0412 \u0446\u0435\u043d\u0442\u0440\u0435
CTL_Right=\u0421\u043f\u0440\u0430\u0432\u0430

#VerticalPositionProperty
CTL_Top=\u0421\u0432\u0435\u0440\u0445\u0443
CTL_Center=\u0412 \u0446\u0435\u043d\u0442\u0440\u0435
CTL_Bottom=\u0421\u043d\u0438\u0437\u0443

#ScrollPolicyProperties
CTL_Always=\u0412\u0441\u0435\u0433\u0434\u0430
CTL_Never=\u041d\u0438\u043a\u043e\u0433\u0434\u0430
CTL_Auto=\u0410\u0432\u0442\u043e

#ValueTypeProperty
CTL_RegExp=\u0420\u0435\u0433\u0443\u043b\u044f\u0440\u043a\u0430
CTL_Mask=\u041c\u0430\u0441\u043a\u0430
CTL_Number=\u0427\u0438\u0441\u043b\u043e
CTL_Percent=\u041f\u0440\u043e\u0446\u0435\u043d\u0442\u044b
CTL_DateTime=\u0414\u0430\u0442\u0430/\u0412\u0440\u0435\u043c\u044f
CTL_Currency=\u0412\u0430\u043b\u044e\u0442\u0430

#ButtonGroupPropertyEditor
CTL_ButtonGroupPropertyEditor_DisplayName=\u0412\u044b\u0431\u043e\u0440 \u0433\u0440\u0443\u043f\u043f\u044b \u043a\u043d\u043e\u043f\u043e\u043a/\u043c\u0435\u0442\u043e\u043a

#AccessibleParentEditor
CTL_AccessibleParentEditor_DisplayName=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u043e\u0433\u043e \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u044f

#EventCustomEditor
CTL_EE_ADD=&\u0414\u043e\u0431\u0430\u0432\u0438\u0442\u044c...
CTL_EE_REMOVE=&\u0423\u0434\u0430\u043b\u0438\u0442\u044c
CTL_EE_RENAME=\u041f\u0435\u0440\u0435&\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c...
CTL_EE_RENAME_CAPTION=\u041f\u0435\u0440\u0435\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a
CTL_EE_RENAME_LABEL=&\u041d\u043e\u0432\u043e\u0435 \u0438\u043c\u044f \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a\u0430:
CTL_EE_NOT_IDENTIFIER=\u0418\u043c\u044f \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a\u0430 \u043d\u0435 \u043c\u043e\u0436\u0435\u0442 \u0431\u044b\u0442\u044c \u0438\u0434\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440\u043e\u043c Java.
CTL_EE_ALREADY_EXIST=\u041e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a \u0441 \u0442\u0430\u043a\u0438\u043c \u0438\u043c\u0435\u043d\u0435\u043c \u0443\u0436\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442.
CTL_EE_ADD_CAPTION=\u0414\u043e\u0431\u0430\u0432\u0438\u0442\u044c \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a
CTL_EE_ADD_LABEL=&\u041d\u043e\u0432\u043e\u0435 \u0438\u043c \u043e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a\u0430:
CTL_EE_Handlers=\u041e\u0431\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a\u0438
ACSD_CTL_EE_Handlers=N/A
ACSD_CTL_EE_ADD=N/A
ACSD_CTL_EE_REMOVE=N/A
ACSD_CTL_EE_RENAME=N/A
ACSD_EventCustomEditor=N/A

MSG_FormSizePolicy=\u041f\u043e\u043b\u0438\u0442\u0438\u043a\u0430 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u0444\u043e\u0440\u043c\u044b
HINT_FormSizePolicy=\u0423\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0435\u0442 \u0441\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043a\u043e\u0434\u0430 \u0443\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u044f \u0440\u0430\u0437\u043c\u0435\u0440\u043e\u043c \u0444\u043e\u0440\u043c\u044b.
MSG_FormSize=\u0420\u0430\u0437\u043c\u0435\u0440 \u0444\u043e\u0440\u043c\u044b
HINT_FormSize=\u0423\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0435\u0442 \u043d\u0430\u0447\u0430\u043b\u043d\u044b\u0439 \u0440\u0430\u0437\u043c\u0435\u0440 \u0444\u043e\u0440\u043c\u044b.
MSG_FormPosition=\u041f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u0435 \u0444\u043e\u0440\u043c\u044b
HINT_FormPosition=\u0423\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0435\u0442 \u043f\u043e\u0437\u0438\u0446\u0438\u044e, \u0432 \u043a\u043e\u0442\u043e\u0440\u043e\u0439 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u043f\u043e\u044f\u0432\u0438\u0442\u0441\u044f \u043d\u0430 \u044d\u043a\u0440\u0430\u043d\u0435.
MSG_GeneratePosition=\u0421\u043e\u0437\u0434\u0430\u0442\u044c \u043f\u043e\u0437\u0438\u0446\u0438\u044e
HINT_GeneratePosition=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0431\u0443\u0434\u0435\u0442 \u0441\u043e\u0437\u0434\u0430\u043d \u043a\u043e\u0434, \u043e\u0440\u0438\u0435\u043d\u0442\u0438\u0440\u0443\u044e\u0449\u0438\u0439\u0441\u044f \u043d\u0430 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u0444\u043e\u0440\u043c\u044b \"\u043f\u043e\u0437\u0438\u0446\u0438\u044f\".
MSG_GenerateSize=\u0421\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u0440\u0430\u0437\u043c\u0435\u0440
HINT_GenerateSize=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u0431\u0443\u0434\u0435\u0442 \u0441\u043e\u0437\u0434\u0430\u043d \u043a\u043e\u0434, \u043e\u0440\u0438\u0435\u043d\u0442\u0438\u0440\u0443\u044e\u0449\u0438\u0439\u0441\u044f \u043d\u0430  \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e \u0444\u043e\u0440\u043c\u044b \"\u0440\u0430\u0437\u043c\u0435\u0440\".
MSG_GenerateCenter=\u0421\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u0446\u0435\u043d\u0442\u0440
HINT_GenerateCenter=\u0415\u0441\u043b\u0438 \u0432\u043a\u043b\u044e\u0447\u0435\u043d\u043e, \u0442\u043e \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u0431\u0443\u0434\u0435\u0442 \u043f\u043e\u043c\u0435\u0449\u0435\u043d\u043e \u0432 \u0446\u0435\u043d\u0442\u0440\u0435 \u044d\u043a\u0440\u0430\u043d\u0430.
MSG_DesignerSize=\u0420\u0430\u0437\u043c\u0435\u0440 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u0430
HINT_DesignerSize=\u0420\u0430\u0437\u043c\u0435\u0440 \u0430\u043a\u0442\u0438\u0432\u043d\u043e\u0439 \u0437\u043e\u043d\u044b \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u0430.

# names of property values for Size Policy property
VALUE_sizepolicy_pack=\u0412\u044b\u0437\u044b\u0432\u0430\u0442\u044c \u043c\u0435\u0442\u043e\u0434 pack()
VALUE_sizepolicy_full=\u0421\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043a\u043e\u0434 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0440\u0430\u0437\u043c\u0435\u0440\u0430
VALUE_sizepolicy_none=\u041d\u0435\u0442 \u043a\u043e\u0434\u0430 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0440\u0430\u0437\u043c\u0435\u0440\u0430

#Layout Size Property Editor
VALUE_SizeNotExplicitelyDefined=\u041f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e.

#Form Custom Editor
CTL_PropertyEditorDoesNot=\u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0435 \u0440\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u044d\u0442\u043e\u0433\u043e \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043d\u0435 \u043f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044f
CTL_DefaultEditor_DisplayName=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e
# {0} = description of selected custom editor
ACSD_FormCustomEditor=\u0420\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 {0}

# Selecting editing mode for the property
# {0} = component name (name of the variable)
# {1} = name of the property being set
# Example:
# Set jButton1's text property using:
FMT_EditingModeLabel1=<html>\u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e <b>{1}</b> \u0432 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0435 <b>{0}</b> \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044f:
# simplified version - if the edited property is not a bean property
# {0} = name of the property being set
FMT_EditingModeLabel2=<html>\u0423\u0441\u0442\u0430\u043d\u043e\u0432\u0438\u0442\u044c \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e <b>{0}</b> \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044f:
EditingMode_Hint=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u0441\u043f\u043e\u0441\u043e\u0431 \u0443\u043a\u0430\u0437\u0430\u043d\u0438\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430
ACSD_EditingMode=N/A

# Tooltips of aligning buttons in form designer
CTL_AlignAction_l=\u0412\u044b\u0440\u043e\u0432\u043d\u044f\u0442\u044c \u043f\u043e \u043b\u0435\u0432\u043e\u043c\u0443 \u043a\u0440\u0430\u044e \u0432 \u0441\u0442\u043e\u043b\u0431\u0446\u0435
CTL_AlignAction_r=\u0412\u044b\u0440\u043e\u0432\u043d\u044f\u0442\u044c \u043f\u043e \u043f\u0440\u0430\u0432\u043e\u043c\u0443 \u043a\u0440\u0430\u044e \u0432 \u0441\u0442\u043e\u043b\u0431\u0446\u0435
CTL_AlignAction_u=\u0412\u044b\u0440\u043e\u0432\u043d\u044f\u0442\u044c \u043f\u043e \u0432\u0435\u0440\u0445\u043d\u0435\u0439 \u0433\u0440\u0430\u043d\u0438\u0446\u0435 \u0432 \u0441\u0442\u0440\u043e\u043a\u0435
CTL_AlignAction_d=\u0412\u044b\u0440\u043e\u0432\u043d\u044f\u0442\u044c \u043f\u043e \u043d\u0438\u0436\u043d\u0435\u0439 \u0433\u0440\u0430\u043d\u0438\u0446\u0435 \u0432 \u0441\u0442\u0440\u043e\u043a\u0435
CTL_AlignAction_ch=\u0426\u0435\u043d\u0442\u0440\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043f\u043e \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u0438
CTL_AlignAction_cv=\u0426\u0435\u043d\u0442\u0440\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043f\u043e \u0432\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u0438
CTL_ResizeButton_h=\u0418\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0435 \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u043f\u043e \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u0438
CTL_ResizeButton_v=\u0418\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0435 \u0440\u0430\u0437\u043c\u0435\u0440\u0430 \u043f\u043e \u0432\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u0438
CTL_AnchorButton_u=\u0418\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u0432\u0435\u0440\u0445\u043d\u0438\u0439 \u044f\u043a\u043e\u0440\u044c
CTL_AnchorButton_d=\u0418\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u043d\u0438\u0436\u043d\u0438\u0439 \u044f\u043a\u043e\u0440\u044c
CTL_AnchorButton_l=\u0418\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u043b\u0435\u0432\u044b\u0439 \u044f\u043a\u043e\u0440\u044c
CTL_AnchorButton_r=\u0418\u0437\u043c\u0435\u043d\u0438\u0442\u044c \u043f\u0440\u0430\u0432\u044b\u0439 \u044f\u043a\u043e\u0440\u044c

# RADComponentCreator
FMT_CreatorTableTitle=\u0417\u0430\u0433\u043e\u043b\u043e\u0432\u043e\u043a
FMT_CreatorComboBoxItem=\u042d\u043b\u0435\u043c\u0435\u043d\u0442
FMT_CreatorListItem=\u042d\u043b\u0435\u043c\u0435\u043d\u0442

ChangeVariableNameAction=\u041f\u0435\u0440\u0435\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c ...
NAME_CustomizeTableAction=\u0421\u043e\u0434\u0435\u0440\u0436\u0438\u043c\u043e\u0435 \u0442\u0430\u0431\u043b\u0438\u0446\u044b ...

#FormEditorCustomizer
KW_FormOptions=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c, \u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b Swing
Form_Editor=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c
Form_Editor_Tooltip=\u041d\u0430\u0441\u0442\u0440\u043e\u0439\u043a\u0430 \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u0430 \u0444\u043e\u0440\u043c
Fold=\u0421\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u0441\u0432\u043e\u0440\u0430\u0447\u0438\u0432\u0430\u0435\u043c\u044b\u0439 \u043a\u043e\u0434
Assistant=&\u041f\u043e\u043a\u0430\u0437\u044b\u0432\u0430\u0442\u044c \u043f\u043e\u0434\u0441\u043a\u0430\u0437\u043a\u0438
Public_Modifier=public
Default_Modifier=<default>
Protected_Modifier=protected
Private_Modifier=private
Anonymous=\u0410\u043d\u043e\u043d\u0438\u043c\u043d\u044b\u0435 \u0432\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u0438\u0435 \u043a\u043b\u0430\u0441\u0441\u044b
InnerClass=\u041e\u0434\u0438\u043d \u0432\u043d\u0443\u0442\u0440\u0435\u043d\u043d\u0438\u0439 \u043a\u043b\u0430\u0441\u0441
MainClass=\u0413\u043b\u0430\u0432\u043d\u044b\u0439 \u043a\u043b\u0430\u0441\u0441
Generate_Components=\u0421\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u043a\u0430\u043a:
Generate_Components_Hint=\u041e\u043f\u0440\u0435\u0434\u0435\u043b\u044f\u0435\u0442 \u043d\u0430\u0434\u043e \u043b\u0438 \u0441\u043e\u0437\u0434\u0430\u0432\u0430\u0442\u044c \u043b\u043e\u043a\u0430\u043b\u043d\u044b\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u0438\u043b\u0438 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0434\u043b\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432.
Generate_Locals=&\u041b\u043e\u043a\u0430\u043b\u044c\u043d\u044b\u0435 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0435 \u0432 \u043c\u0435\u0442\u043e\u0434\u0435 initComponents()
Generate_Locals_ACSD=N/A
Generate_Fields=&\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043a\u043b\u0430\u0441\u0441\u0430 \u0444\u043e\u0440\u043c\u044b
Generate_Fields_ACSD=N/A
Variable_Modifier=&\u041c\u043e\u0434\u0438\u0444\u0438\u043a\u0430\u0442\u043e\u0440 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u044b\u0445:
Layout_Style=\u0421\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u0440\u0430\u0437\u043c\u0435\u0449\u0435\u043d\u0438\u044f:
Component_Names=\u0423\u0441\u0442\u0430\u043d\u0430\u0432\u043b\u0438\u0432\u0430\u0442\u044c \u0438\u043c\u0435\u043d\u0430 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432:
Listener_Style=\u0421\u043f\u043e\u0441\u043e\u0431 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f \u043f\u043e\u0434\u043f\u0438\u0441\u0447\u0438\u043a\u043e\u0432 \u0441\u043e\u0431\u044b\u0442\u0438\u0439:
Code_Generation=\u0420\u0435\u0434\u0430\u043a\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u0444\u043e\u0440\u043c\u044b
Auto_I18n=&\u0410\u0432\u0442\u043e\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0430\u044f \u043b\u043e\u043a\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u044f:
Grid_SizeX=&\u0428\u0430\u0433 \u0441\u0435\u0442\u043a\u0438 \u043f\u043e \u0433\u043e\u0440\u0438\u0437\u043e\u043d\u0442\u0430\u043b\u0438:
Grid_SizeY=&\u0428\u0430\u0433 \u0441\u0435\u0442\u043a\u0438 \u043f\u043e \u0432\u0435\u0440\u0442\u0438\u043a\u0430\u043b\u0438:
Selection_Border_Color=\u0426\u0432\u0435\u0442 \u0440\u0430\u043c\u043a\u0438 \u0432\u044b\u0434\u0435\u043b\u0435\u043d\u0438\u044f:
Guiding_Line_Color=\u0426\u0432\u0435\u0442 \u0432\u0441\u043f\u043e\u043c\u043e\u0433\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0439 \u043b\u0438\u043d\u0438\u0438:
Generate_FQN=\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u043a\u0432\u0430\u043b\u0438\u0444\u0438\u0446\u0438\u0440\u043e\u0432\u0430\u043d\u043d\u044b\u0435 \u0438\u043c\u0435\u043d\u0430 \u043a\u043b\u0430\u0441\u0441\u043e\u0432 \u043f\u0440\u0438 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0438 \u043a\u043e\u0434\u0430

MSG_Paiting_Exception=\u0421\u043b\u0435\u0434\u0443\u044e\u0449\u0435\u0435 \u0438\u0441\u043a\u043b\u044e\u0447\u0435\u043d\u0438\u0435 \u043f\u0440\u043e\u0438\u0437\u043e\u0448\u043b\u043e \u0432 \u043f\u0440\u043e\u0446\u0435\u0441\u0441\u0435 \u0440\u0438\u0441\u043e\u0432\u0430\u043d\u0438\u044f \u0444\u043e\u0440\u043c\u044b. \
\u0418\u0441\u043f\u0440\u0430\u0432\u044c\u0442\u0435 \u0438\u043b\u0438 \u0443\u0434\u0430\u043b\u0438\u0442\u0435 \u043f\u0440\u043e\u0431\u043b\u0435\u043c\u043d\u044b\u0439 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u0438\u0441\u043f\u0435\u043a\u0442\u043e\u0440\u0430 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432.

TITLE_Choose_Bean=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442
MSG_Choose_Bean=\u0418\u043c\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430:
MSG_DefaultPackageBean=\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u044b \u0438\u0437 \u043f\u0430\u043a\u0435\u0442\u0430 \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e \u043c\u043e\u0433\u0443\u0442 \u0431\u044b\u0442\u044c \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u044b \u0442\u043e\u043b\u044c\u043a\u043e \u0432\u043d\u0443\u0442\u0440\u0438 \u044d\u0442\u043e\u0433\u043e \u043f\u0430\u043a\u0435\u0442\u0430.

TITLE_UserQuestion=\u0412\u043e\u043f\u0440\u043e\u0441

# code customization

# subst messages used as comments in editor in code customizer window
CustomCode-SubstSub=\u041a\u043e\u0434 \u0434\u043e\u0447\u0435\u0440\u043d\u0438\u0445 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432 - \u0437\u0434\u0435\u0441\u044c \u043d\u0435 \u043f\u043e\u043a\u0430\u0437\u0430\u043d
CustomCode-SubstLayout=\u041a\u043e\u0434 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f - \u0437\u0434\u0435\u0441\u044c \u043d\u0435 \u043f\u043e\u043a\u0430\u0437\u0430\u043d
CustomCode-SubstSubAndLayout=\u041a\u043e\u0434 \u0434\u043e\u0447\u0435\u0440\u043d\u0438\u0445 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432 \u0438 \u0440\u0430\u0441\u043f\u043e\u043b\u043e\u0436\u0435\u043d\u0438\u044f - \u0437\u0434\u0435\u0441\u044c \u043d\u0435 \u043f\u043e\u043a\u0430\u0437\u0430\u043d
CustomCode-SubstAdding=\u041a\u043e\u0434 \u0434\u043e\u0431\u0430\u0432\u043b\u044f\u044e\u0449\u0438\u0439 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442 \u0432 \u043a\u043e\u043d\u0442\u0435\u0439\u043d\u0435\u0440 - \u0437\u0434\u0435\u0441\u044c \u043d\u0435 \u043f\u043e\u043a\u0430\u0437\u0430\u043d
CustomCode-SubstNoValue=\u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u043d\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043b\u0435\u043d\u043e

# used with CTL_GuardCombo_Default in a combo box
CustomCode-Creation=\u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0435 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435
CustomCode-Creation_Hint=\u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0435 \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435 (\u044d\u043a\u0437\u0435\u043c\u043f\u043b\u044f\u0440\u0430) \u0434\u043b\u044f \u044d\u0442\u043e\u0433\u043e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
CustomCode-Property=\u0421\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e
CustomCode-Property_Hint=\u0414\u043b\u044f \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u044d\u0442\u043e\u0433\u043e \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u0435\u0442\u0441\u044f \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u044b\u0439 \u043a\u043e\u0434
# parameter {0} is name of the property setter; the result is e.g. pre-setText
CustomCode-PreProperty_Format=\u041f\u0440\u0435-{0}
CustomCode-PreProperty_Hint=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u0435\u0440\u0435\u0434 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u043e\u0439 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430
CustomCode-PostProperty_Format=\u041f\u043e\u0441\u0442-{0}
CustomCode-PostProperty_Hint=\u041a\u043e\u0434, \u0432\u043a\u043b\u044e\u0447\u0430\u0435\u043c\u044b\u0439 \u043f\u043e\u0441\u043b\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430

CustomCode-AfterAllSet=\u043f\u043e\u0441\u043b\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u0438 \u0432\u0441\u0435\u0433\u043e
CustomCode-PreCreation=\u043f\u0440\u0435-\u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435
CustomCode-PostCreation=\u043f\u043e\u0441\u0442-\u0441\u043e\u0437\u0434\u0430\u043d\u0438\u0435
CustomCode-PreInit=\u043f\u0440\u0435-\u0438\u043d\u0438\u0442
CustomCode-PostInit=\u043f\u043e\u0441\u0442-\u0438\u043d\u0438\u0442
CustomCode-PreAdding=\u043f\u0440\u0435-\u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u0435
CustomCode-PostAdding=\u043f\u043e\u0441\u0442-\u0434\u043e\u0431\u0430\u0432\u043b\u0435\u043d\u0438\u0435
CustomCode-PrePopulation=\u043f\u0440\u0435-\u043d\u0430\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0435
CustomCode-PostPopulation=\u043f\u043e\u0441\u0442-\u043d\u0430\u043f\u043e\u043b\u043d\u0435\u043d\u0438\u0435
CustomCode-PostListeners=\u043f\u0440\u0435-\u0441\u043b\u0443\u0448\u0430\u0442\u0435\u043b\u0438
CustomCode-PreDeclaration=\u043f\u0440\u0435-\u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u0435
CustomCode-PostDeclaration=\u043f\u043e\u0441\u0442-\u043e\u0431\u044a\u044f\u0432\u043b\u0435\u043d\u0438\u0435

# Code Customizer dialog
TITLE_CodeCustomizer=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u043a\u043e\u0434\u0430
CustomCodeView.accessibleDescription=\u0414\u0438\u0430\u043b\u043e\u0433 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u043a\u0438 \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e \u043a\u043e\u0434\u0430 \u0434\u043b\u044f \u0432\u044b\u0431\u0440\u0430\u043d\u043d\u044b\u0445 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u043e\u0432
CTL_RenameTitle=\u041f\u0435\u0440\u0435\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c \u043a\u043e\u043c\u043f\u043e\u043f\u043d\u0435\u043d\u0442
CTL_RenameLabel=\u041d\u043e\u0432\u043e\u0435 \u0438\u043c\u044f
CTL_ApplyChangesLabel=\u0414\u043b\u044f \u0442\u043e\u0433\u043e \u0447\u0442\u043e\u0431\u044b \u043f\u0435\u0440\u0435\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442, \u0441\u043d\u0430\u0447\u0430\u043b\u0430 \u0441\u043b\u0435\u0434\u0443\u0435\u0442 \u043f\u0440\u0438\u043c\u0435\u043d\u0438\u0442\u044c \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0432 \u043a\u043e\u0434\u0435.\n\
\u041f\u0440\u043e\u0434\u043e\u043b\u0436\u0438\u0442\u044c?
CTL_ApplyChangesTitle=\u041f\u0440\u0438\u043c\u0435\u043d\u0438\u0442\u044c \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f
CustomCodeView.renameButton.text=&\u041f\u0435\u0440\u0435\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c...
CustomCodeView.renameButton.toolTipText=\u041f\u0435\u0440\u0435\u0438\u043c\u0435\u043d\u043e\u0432\u0430\u0442\u044c \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u0443\u044e \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430
CustomCodeView.selectComponentLabel.text=&\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442:
CustomCodeView.componentCombo.toolTipText=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442, \u043a\u043e\u0434 \u043a\u043e\u043e\u0442\u043e\u0440\u043e\u0433\u043e \u043d\u0430\u0434\u043e \u0438\u0437\u043c\u0435\u043d\u0438\u0442\u044c
CustomCodeView.initCodeLabel.text=&\u041a\u043e\u0434 \u0438\u043d\u0438\u0446\u0438\u0430\u043b\u0438\u0437\u0430\u0446\u0438\u0438
CustomCodeView.declarationCodeLabel.text=\u041a\u043e\u0434 \u043e\u0431\u044a\u0432\u0432\u043b\u0435\u043d\u0438 \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439
CustomCodeView.variableScopeLabel.text=&\u041f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u0430\u044f:
CustomCodeView.variableAccessLabel.text=&\u0414\u043e\u0441\u0442\u0443\u043f:
CTL_GuardCombo_Default=\u041a\u043e\u0434 \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e
CTL_GuardCombo_Default_Hint=\u0421\u0433\u0435\u043d\u0435\u0440\u0438\u0440\u043e\u0432\u0430\u043d \u043a\u043e\u0434 \u043f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e. \u0412\u044b \u043c\u043e\u0436\u0435\u0442\u0435 \u043f\u0435\u0440\u0435\u043a\u043b\u044e\u0447\u0438\u0442\u0441\u044f \u043a \u0441\u043f\u0435\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u043c\u0443 \u043a\u043e\u0434\u0443 \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e \u044d\u0442\u043e\u0433\u043e \u043f\u043e\u043b\u044f \u0441\u043e \u0441\u043f\u0438\u0441\u043a\u043e\u043c.
CTL_VariableCombo_Local=\u041b\u043e\u043a\u0430\u043b\u044c\u043d\u0430\u044f \u043f\u0435\u0440\u0435\u043c\u0435\u043d\u043d\u0430\u044f
CTL_VariableCombo_Field=\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e
CTL_AccessCombo_package_private=<\u041f\u043e \u0443\u043c\u043e\u043b\u0447\u0430\u043d\u0438\u044e>
CustomCodeView.finalCheckBox.accessibleDescription=N/A
CustomCodeView.staticCheckBox.accessibleDescription=N/A
CustomCodeView.transientCheckBox.accessibleDescription=N/A
CustomCodeView.volatileCheckBox.accessibleDescription=N/A

MSG_BindingCustomizer_ACSD=N/A
MSG_BindingCustomizer_Bind=<html>\u041f\u0440\u0438\u0432\u044f\u0437\u0430\u0442\u044c \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u043e <b>{1}</b> ({2}) \u043a:
MSG_BindingCustomizer_Source=\u041f\u0440\u0438\u0432\u044f\u0437\u0430\u043d\u043d\u044b\u0439 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\:
MSG_BindingCustomizer_Source_ACSD=N/A
MSG_BindingCustomizer_Expression=\u0412\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 \u0441\u0432\u044f\u0437\u044b\u0432\u0430\u043d\u0438\u044f\:
MSG_BindingCustomizer_Expression_ACSD=N/A
MSG_BindingCustomizer_DisplayExpression=&\u0412\u044b\u0440\u0430\u0436\u0435\u043d\u0438\u0435 \u043e\u0442\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u0438\u044f\:
MSG_BindingCustomizer_DisplayExpression_ACSD=N/A
MSG_BindingCustomizer_OK=OK
MSG_BindingCustomizer_Cancel=\u041e\u0442\u043c\u0435\u043d\u0430
MSG_BindingCustomizer_Binding=\u0421\u0432\u044f\u0437\u044b\u0432\u0430\u043d\u0438\u0435 {0}.{1}
MSG_BindingCustomizer_None=<\u041d\u0435 \u043f\u0440\u0438\u0432\u044f\u0437\u0430\u043d\u043e>
MSG_Binding_SelectSubbindings=\u0412\u044b\u0431\u0435\u0440\u0438\u0442\u0435 \u0430\u0442\u0440\u0438\u0431\u0443\u0442\u044b, \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043d\u0430\u0434\u043e \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c\u0441\u044f \u043a\u0430\u043a \u0441\u0442\u043e\u043b\u0431\u0446\u044b \u0442\u0430\u0431\u043b\u0438\u0446\u044b.
MSG_BindingCustomizer_SelectAll=\u0412\u044b\u0431\u0440\u0430\u0442\u044c \u0432\u0441\u0435
MSG_BindingCustomizer_DeselectAll=\u0421\u043d\u044f\u0442\u044c \u0432\u0441\u0435 \u0432\u044b\u0434\u0435\u043b\u0435\u043d\u0438\u0435
MSG_BindingCustomizer_Up=\u0412\u0432\u0435\u0440\u0445
MSG_BindingCustomizer_Down=\u0412\u043d\u0438\u0437
MSG_BindingCustomizer_BindingTab=\u0421\u0432\u044f\u0437\u044b\u0432\u0430\u043d\u0438\u0435
MSG_BindingCustomizer_AdvancedTab=\u0420\u0430\u0441\u0448\u0438\u0440\u0435\u043d\u043d\u044b\u0435
MSG_BindingCustomizer_UpdateProperties=<html><b>\u041e\u0431\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0435 \u0441\u0432\u043e\u0439\u0441\u0442\u0432
MSG_BindingCustomizer_Update=\u0423\u043a\u0430\u0436\u0438\u0442\u0435 \u043a\u0430\u043a \u043e\u0431\u043d\u043e\u0441\u043b\u044f\u044e\u0442\u0441\u044f \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a \u0438 \u043f\u0440\u0438\u0435\u043c\u043d\u0438\u043a
MSG_BindingCustomizer_UpdateMode=\u0420\u0435\u0436\u0438\u043c \u043e\u0431\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u044f\:
MSG_BindingCustomizer_UpdateMode_ACSD=N/A
MSG_BindingCustomizer_UpdateMode1=\u0412\u0441\u0435\u0433\u0434\u0430 \u0441\u0438\u043d\u0445\u0440\u043e\u043d\u0438\u0437\u0438\u0440\u043e\u0432\u0430\u043d\u043e (\u0447\u0442\u0435\u043d\u0438\u0435/\u0437\u0430\u043f\u0438\u0441\u044c)
MSG_BindingCustomizer_UpdateMode2=\u0422\u043e\u043b\u044c\u043a\u043e \u0447\u0442\u0435\u043d\u0438\u0435 \u0438\u0437 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\u0430 (\u0442\u043e\u043b\u044c\u043a\u043e \u0447\u0442\u0435\u043d\u0438\u0435)
MSG_BindingCustomizer_UpdateMode3=\u041e\u0434\u043d\u043e\u043a\u0440\u0430\u0442\u043d\u043e\u0435 \u0447\u0442\u0435\u043d\u0438\u0435 \u0438\u0437 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\u0430 (\u043e\u0434\u043d\u043e\u043a\u0440\u0430\u0442\u043d\u043e\u0435 \u0447\u0442\u0435\u043d\u0438\u0435)
MSG_BindingCustomizer_UpdateWhen=\u041e\u0431\u043d\u043e\u0432\u043b\u044f\u0442\u044c \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a \u043a\u043e\u0433\u0434\u0430\:
MSG_BindingCustomizer_UpdateWhen_ACSD=N/A
MSG_BindingCustomizer_UpdateWhen1=\u041d\u0430\u0436\u0430\u0442\u0430 \u043a\u043b\u0430\u0432\u0438\u0448\u0430 \"Enter\" \u0438\u043b\u0438 \u043f\u043e\u0442\u0435\u0440\u044f\u043d \u0444\u043e\u043a\u0443\u0441
MSG_BindingCustomizer_UpdateWhen2=\u041f\u043e\u0442\u0435\u0440\u044f \u0444\u043e\u043a\u0443\u0441\u0430
MSG_BindingCustomizer_UpdateWhen3=\u0412\u043e \u0432\u0440\u0435\u043c\u044f \u043d\u0430\u0431\u043e\u0440\u0430 \u0442\u0435\u043a\u0441\u0442\u0430
MSG_BindingCustomizer_IgnoreAdjusting=\u0418\u0433\u043d\u043e\u0440\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u043f\u0440\u043e\u043c\u0435\u0436\u0443\u0442\u043e\u0447\u043d\u044b\u0435 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f
MSG_BindingCustomizer_SpecialValues=<html><b>\u041f\u043e\u043c\u0435\u043d\u044f\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u043c\u0435\u0441\u0442\u0430\u043c\u0438 
MSG_BindingCustomizer_DisplayValues=\u0418\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u044d\u0442\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0435\u0441\u043b\u0438 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\u0430 null \u0438\u0434\u0438 \u043e\u043d\u043e \u043d\u0435\u0437\u0430\u043a\u043e\u043d\u0447\u0435\u043d\u043e
MSG_BindingCustomizer_NullValue=N&ull-\u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\u0430\:
MSG_BindingCustomizer_NullValue_ACSD=N/A
MSG_BindingCustomizer_IncompletePathValue=\u041d\u0435 \u0447\u0438\u0442\u0430\u0435\u043c\u043e\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\u0430\:
MSG_BindingCustomizer_IncompletePathValue_ACSD=N/A
MSG_BindingCustomizer_Conversion=<html><b>\u041a\u043e\u043d\u0432\u0435\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u0435 \u0442\u0438\u043f\u0430
MSG_BindingCustomizer_Validation=<html><b>\u041f\u0440\u043e\u0432\u0435\u0440\u043a\u0430
MSG_BindingCustomizer_Validator=&\u041a\u043e\u043d\u0442\u0440\u043e\u043b\u043b\u0435\u0440\:
MSG_BindingCustomizer_Validator_ACSD=N/A
MSG_BindingCustomizer_Converter=&\u041a\u043e\u043d\u0432\u0435\u0440\u0442\u0435\u0440\:
MSG_BindingCustomizer_Converter_ACSD=N/A
MSG_BindingCustomizer_ValidationTxt=\u041f\u0440\u043e\u0432\u0435\u0440\u044f\u0442\u044c \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f \u0441 \u0438\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u043d\u0438\u0435\u043c:
MSG_BindingCustomizer_ConversionTxt=\u041a\u043e\u043d\u0432\u0435\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u043c\u0435\u0436\u0434\u0443 \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a\u043e\u043c \u0438 \u043f\u0440\u0438\u0435\u043c\u043d\u0438\u043a\u043e\u043c \u0441 \u043f\u043e\u043c\u043e\u0449\u044c\u044e:
MSG_BindingCustomizer_ImportData=&\u0418\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0442\u044c \u0434\u0430\u043d\u043d\u044b\u0435 \u0438\u0437...
MSG_BindingCustomizer_ImportData_ACSD=N/A
MSG_BindingCustomizer_NullExpression=<\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c \u0438\u0441\u0442\u043e\u0447\u043d\u0438\u043a \u0441\u0432\u044f\u0437\u044b\u0432\u0430\u043d\u0438\u044f>
MSG_BindingCustomizer_NullDisplayExpression=<\u0418\u0441\u043f\u043e\u043b\u044c\u0437\u043e\u0432\u0430\u0442\u044c element.toString()>
MSG_BindingCustomizer_Identification=<html><b>\u0418\u0434\u0435\u043d\u0442\u0438\u0444\u0438\u043a\u0430\u0446\u0438\u044f
MSG_BindingCustomizer_Name=&\u0418\u043c\u044f\:
MSG_BindingCustomizer_Name_ACSD=N/A
MSG_BindingCustomizer_Please_Wait=\u041f\u043e\u0434\u043e\u0436\u0434\u0438\u0442\u0435 \u043f\u043e\u0436\u0430\u043b\u0443\u0439\u0442\u0441\u0442\u0430
MSG_BindingCustomizer_Importing=\u0418\u043c\u043f\u043e\u0440\u0442\u0438\u0440\u043e\u0432\u0430\u0440\u043d\u0438\u0435 ...
MSG_Binding_NullProperty=\u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 Null
MSG_Binding_IncompletePathProperty=\u041d\u0435\u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043d\u043d\u044b\u0439 \u043f\u0443\u0442\u044c
MSG_Binding_Converter=\u041a\u043e\u043d\u0432\u0435\u0440\u0442\u0435\u0440
MSG_Binding_Validator=\u041a\u043e\u043d\u0442\u0440\u043e\u043b\u043b\u0435\u0440
MSG_Binding_Name=\u0418\u043c\u044f

# Form Connection custom property editor
ConnectionCustomEditor.jLabel1.text=\u0412\u0437\u044f\u0442\u044c \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 \u0438\u0437\:
ConnectionCustomEditor.beanRadio.text=&\u041a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\:
ConnectionCustomEditor.propertyRadio.text=&\u0421\u0432\u043e\u0439\u0441\u0442\u0432\u043e\:
ConnectionCustomEditor.methodRadio.text=&\u0412\u044b\u0437\u043e\u0432 \u043c\u0435\u0442\u043e\u0434\u0430\:
ConnectionCustomEditor.propertyDetailsButton.text=...
ConnectionCustomEditor.methodDetailsButton.text=...

ConnectionCustomEditor.beanRadio.accessibleDescription=N/A
ConnectionCustomEditor.propertyRadio.accessibleDescription=N/A
ConnectionCustomEditor.methodRadio.accessibleDescription=N/A
ConnectionCustomEditor.beansCombo.accessibleDescription=N/A
ConnectionCustomEditor.propertyField.accessibleDescription=N/A
ConnectionCustomEditor.methodField.accessibleDescription=N/A
ConnectionCustomEditor.propertyDetailsButton.accessibleDescription=N/A
ConnectionCustomEditor.methodDetailsButton.accessibleDescription=N/A
ConnectionCustomEditor.beanCombo.accessibleDescription=N/A

CodeCustomEditor.codeLabel=\u041a\u043e\u0434 \u0441\u0432\u043e\u0439\u0441\u0442\u0432\u0430:

# dialog asking about format version upgrade
TITLE_FormatUpgrade=\u041e\u0431\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u0435 \u0444\u043e\u0440\u043c\u0430\u0442\u0430 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u044f
MSG_UpgradeQuestion=\u042d\u0442\u0430 \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u0441\u0442\u0430\u0440\u043e\u0439 \u0432\u0435\u0440\u0441\u0438\u0438. \u041f\u043e\u0441\u043b\u0435 \u043e\u0431\u043d\u043e\u0432\u043b\u0435\u043d\u0438\u044f \u0444\u043e\u0440\u043c\u0430\u0442\u0430 \u0432\u044b \u0441\u043c\u043e\u0436\u0435\u0442\u0435 \u043e\u0442\u043a\u0440\u044b\u0432\u0430\u0442\u044c \u044d\u0442\u043e \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435 \u0442\u043e\u043b\u044c\u043a\u043e \u043d\u043e\u0432\u044b\u043c \u0440\u0435\u0434\u0430\u043a\u0442\u043e\u0440\u043e\u043c. \u041f\u0440\u043e\u0434\u043e\u043b\u0436\u0438\u0442\u044c?
CTL_UpgradeOption=\u041e\u0431\u043d\u043e\u0432\u0438\u0442\u044c
CTL_CancelOption=\u041e\u0442\u043c\u0435\u043d\u0430

# Refactoring elements in preview
CTL_RefactoringUpdate1=\u041e\u0431\u043d\u043e\u0432\u0438\u0442\u044c \u043f\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043b\u0435\u043d\u0438\u0435
CTL_RefactoringUpdate2=\u041f\u0435\u0440\u0435\u0441\u043e\u0437\u0434\u0430\u0442\u044c \u043a\u043e\u0434 \u0432 \u0437\u0430\u0449\u0438\u0449\u0430\u0435\u043c\u044b\u0445 \u0441\u0435\u043a\u0446\u0438\u044f\u0445

# Null item display name for EnumEditor combobox
CTL_NullText=null

# Options export
Form.Options.Export.displayName=\u0420\u0435\u0434\u0430\u043a\u0442\u043e\u0440 \u0444\u043e\u0440\u043c
