/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package com.eas.dbcontrols.grid.rt;

import org.junit.Test;

/**
 *
 * @author Gala
 */
public class AssemblyTest {
// TODO: Проследить чтобы в заголовке появлялись метки сортировки, если она задана не только нажатием по
// нему, а и любым другим способом.
// TODO: Проследить чтобы высота смежных заголовков ограниченных сеток была выровненной.
// TODO: Сделать картиночки в левом поле, отражающие состояние записи (новая, исправленная, загружающая содержимое, текущая строка н.д. и т.д.)
// TODO: Action-ы удаления, добавления и добавления в дочерние, для которых будут прозрачны все слои ограниченного/дополненного полями/древовидного и т.д. грида.
// TODO: Проконтроллировать, чтобы редактирование ячеек начиналось по двойному щелчку и чтобы repostEvent() не вмешивался в процесс редактирования ячеек.

    @Test
    public void dummyTest() {
    }
}
